{
  "all_ballots": {
    "Adrian Farrel": [
      {
        "ad": "Adrian Farrel",
        "end": "2014-10-29 10:34:44-07:00",
        "end_reason": "new_position",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adrian Farrel",
        "end": "2014-10-30 07:55:26-07:00",
        "end_reason": "position_updated",
        "start": "2014-10-29 10:34:44-07:00",
        "text": "I'm entering this as a Discuss as input to the debate the IESG will have on this document. I do not expect any action from the document authors at this stage. I will either update the Discuss to show the appropriate actions, or will remove it. It is clear to me that a number of people working across a broad set of network operators have driven this work, and also that there is consensus in the WG as reported by the chairs. Also I see the consensus called by the AD for IETF last call. The document doesn't use  RFC 2119  language (although the first paragraph of Section 1.3 was a surprise to me, if just weird IMHO, and would probably best be removed). But I agree that it is unfortunate to have developed this document in isolation from 3GPP. That is not to say that the IETF should not publish such a document. But to do so without even notifying 3GPP of the work in progress and giving them the chance to comment seems to be regrettable. While it is clear that there is a perceived need for a profile that is different from what the 3GPP previously developed, it would have been good to hear from 3GPP what concerns they have with this new profiles.",
        "type": "Discuss"
      },
      {
        "ad": "Adrian Farrel",
        "end": "2015-03-27 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2014-10-30 07:55:26-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alia Atlas": [
      {
        "ad": "Alia Atlas",
        "end": "2014-10-30 08:19:41-07:00",
        "end_reason": "new_position",
        "start": "2014-03-02 00:00:00+00:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alia Atlas",
        "end": "2018-03-23 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2014-10-30 08:19:41-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Barry Leiba": [
      {
        "ad": "Barry Leiba",
        "end": "2014-10-29 10:17:21-07:00",
        "end_reason": "new_position",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Barry Leiba",
        "end": "2016-04-08 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2014-10-29 10:17:21-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Benoit Claise": [
      {
        "ad": "Benoit Claise",
        "end": "2018-03-23 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Brian Haberman": [
      {
        "ad": "Brian Haberman",
        "end": "2014-10-29 07:03:58-07:00",
        "end_reason": "new_position",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Brian Haberman",
        "end": "2014-10-29 07:58:10-07:00",
        "end_reason": "discuss_updated",
        "start": "2014-10-29 07:03:58-07:00",
        "text": "This is a DISCUSS for the IESG for the time being.  No need for author/chair actions at this time... I believe that this document will be harmful if it is published.  It portrays itself as a viable product profile for 3GPP networks. However, this was done without interactions with 3GPP and creates a situation where user-equipment vendors may be confused as to what profiles are valid for their 3GPP devices.  Despite referring to itself as a set of recommendations, it uses 2119 keywords to turn these recommendations into requirements.  Given that  RFC 7066  exists and device profiles have been developed by other SDOs, I don't believe we should be publishing this document.",
        "type": "Discuss"
      },
      {
        "ad": "Brian Haberman",
        "end": "2014-10-30 03:55:38-07:00",
        "end_reason": "discuss_updated",
        "start": "2014-10-29 07:58:10-07:00",
        "text": "* Clarified my statement based on private feedback * This is a DISCUSS for the IESG for the time being.  No need for author/chair actions at this time... I believe that this document will be harmful if it is published.  It portrays itself as a viable product profile for 3GPP networks. However, this was done without interactions with 3GPP and creates a situation where user-equipment vendors may be confused as to what profiles are valid for their 3GPP devices.  Despite referring to itself as a set of recommendations, it uses 2119 keywords to turn these recommendations into requirements.  Given that  RFC 7066  exists and that this type of profile should be developed within the GSM Association, I don't believe we should be publishing this document.",
        "type": "Discuss"
      },
      {
        "ad": "Brian Haberman",
        "end": "2014-10-31 07:18:18-07:00",
        "end_reason": "discuss_updated",
        "start": "2014-10-30 03:55:38-07:00",
        "text": "* Updated text based on feedback on other ballot positions and private e-mail from the authors * This is a DISCUSS for the IESG for the time being.  No need for author/chair actions at this time... I believe that this document will be harmful if it is published.  It portrays itself as a viable product profile for 3GPP networks. However, this was done without interactions with 3GPP and creates a situation where user-equipment vendors may be confused as to what profiles are valid for their 3GPP devices.  Despite referring to itself as a set of recommendations, it uses 2119 keywords to turn these recommendations into requirements.  Given that  RFC 7066  exists and that this type of profile should be developed within the GSM Association, I don't believe we should be publishing this document. The following was sent to me from one of the authors: I can eventually understand the resistance to see a profile document published, but I thought this first sentence from the draft would softened that:    This document defines an IPv6 profile that a number of operators    recommend in order to connect 3GPP mobile devices to an IPv6-only or    dual-stack wireless network (including 3GPP cellular network and IEEE    802.11 network). The above text clearly illustrates why this document is a problem.  How broad is this \"number of operators\"?  Does it go beyond the 4 operators listed as document authors?  If a vendor implements this profile, will they be capable of operating on a 3G/4G/WLAN network managed by some other operator?  As Adrian noted, the convoluted use of 2119 keywords is troubling and having them couched in an Informational profile document is dubious at best. I support Adrian's notion that 3GPP should at least be notified of this work formally.  The previous work, like  RFC 3314 , was driven by a partnership between 3GPP and the IETF ( https://datatracker.ietf.org/documents/LIAISON/file725.txt ) and we should continue that partnership *if* the consensus is to publish this document as a consensus-based RFC. It is also unclear if the people who raised earlier concerns feel that their concerns were addressed.  I spoke with several of them and they do not think their concerns were addressed, but were tired of fighting over fundamental differences. If a group of operators wants to document a profile that highlights what they want vendors to implement, that should be documented somewhere else besides the IETF. At best, I could see this documented as an ISE document (with all the appropriate warnings).",
        "type": "Discuss"
      },
      {
        "ad": "Brian Haberman",
        "end": "2016-04-08 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2014-10-31 07:18:18-07:00",
        "text": "* Updated based on the discussion during the 2014-10-30 IESG Telechat * This document, in its current form, will be harmful if it is published.  There are several issues that need to be addressed in order to make this a viable IETF consensus-based document. 1. This draft portrays itself as a viable alternative product profile to  RFC 7066 . This document should clearly state that the profile described in this document is a super set of the one defined in 7066. 2. The use of 2119 keywords should be stricken from the document. Their use (regardless of their capitalization) leads to confusion as to whether these are recommendations or requirements. 3. The recommendations in this draft are overly broad. It suffers from some of the problems that led to the re-publication of the IPv6 Node Requirements document, namely trying to provide guidance/requirements that go beyond the base specifications being referenced. Justification needs to be documented for functions that go above and beyond those described in 7066. 4. Given that this document is aimed at devices intended for use in 3GPP networks, 3GPP should be made aware of this work in order to facilitate collaboration on its development. This is a task for the WG chairs and sponsoring AD to work with our 3GPP liaison manager. 5. The addition of extended functionality will need to consider the implications for interoperability with legacy systems developed using  RFC 7066 . Consideration, guidance, or caveats need to be documented for interoperability issues.",
        "type": "Discuss"
      }
    ],
    "Gonzalo Camarillo": [
      {
        "ad": "Gonzalo Camarillo",
        "end": "2014-03-07 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Jari Arkko": [
      {
        "ad": "Jari Arkko",
        "end": "2014-10-30 08:05:01-07:00",
        "end_reason": "new_position",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Jari Arkko",
        "end": "2017-03-31 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2014-10-30 08:05:01-07:00",
        "text": "I'm speaking mostly as an author of RFCs 3316 and 7066 and as a long-term contributor in these discussions. I am not raising a discuss, because Brian is already raising one. And one could perhaps argue that I should not be officially involved in a matter where I have been someone who has argued for particular direction in this space. Hence you should take these as comments only. I think a document in this space would be useful. Potentially very useful for IPv6 deployment. I think we desperately need a document! Unfortunately, we are not quite there with this document. Even if the document has a lot of excellent material. I think the issue is in part the way that the document has been written, partially how it is handled, part is about interoperability, and in part fundamental. As an example of the writing issues, the draft presents itself as a different profile. Casting the document as additional requirements on top of the existing very basic profile (7066) might be a better way to approach the situation. And this is not merely a piece of text to add to the front, the document should actually be structured so that the reader understands what is being added. Secondly, coordination with others who do things in this space would be necessary, i.e., 3GPP. Or at the very least, the document should be clear what its role is. The document could have been called \"Extended IPv6 Profile for Mobile Devices in Foo, Bar, Snaap Operator Networks\", and make it clear that it builds on 3GPP/IETF specifications but adds more functionality to deal with additional situations. Then it would have been a great contribution to make the case that these operators believe they can and should address those additional situations. And there'd be no confusion about what the role of the document is. Thirdly, I think we at IETF should care about interoperability. Brian already said it, but we should not create a fork. That would be bad for everyone. This part clearly needs more work. Some of the additional functions are fine; but I do not have a good understanding of what the rest of the text means for interoperability with existing devices, for instance. Finally, there are some fundamental differences to what has been done before or in 3GPP, like the specification of additional transition mechanisms. While I personally have disagreed with some of those choices in the past, I recognise that I have have been in the rough on this (at least in the IETF, not sure about elsewhere). In any case, with a proper scope for suggested additional requirements in some networks, this would be fine. (I wish I had the time to look at this document earlier. Sorry. All this input at the last moment feels bad. But we may also be repeating some of the discussions we had in V6OPS at the time that we wrote 7066.)",
        "type": "Abstain"
      }
    ],
    "Joel Jaeggli": [
      {
        "ad": "Joel Jaeggli",
        "end": "2013-08-18 14:35:54-07:00",
        "end_reason": "new_position",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Joel Jaeggli",
        "end": "2017-03-31 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2013-08-18 14:35:54-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Kathleen Moriarty": [
      {
        "ad": "Kathleen Moriarty",
        "end": "2014-10-28 12:22:46-07:00",
        "end_reason": "new_position",
        "start": "2014-03-02 00:00:00+00:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Kathleen Moriarty",
        "end": "2018-03-23 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2014-10-28 12:22:46-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Martin Stiemerling": [
      {
        "ad": "Martin Stiemerling",
        "end": "2014-10-29 10:31:07-07:00",
        "end_reason": "new_position",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Martin Stiemerling",
        "end": "2014-10-29 11:52:38-07:00",
        "end_reason": "comment_updated",
        "start": "2014-10-29 10:31:07-07:00",
        "text": "I am balloting Abstain: I do completely support Brian's DISCUSS that this document is not in the right place. The IETF cannot IMHO set requirements for other SDO's devices.",
        "type": "Abstain"
      },
      {
        "ad": "Martin Stiemerling",
        "end": "2016-04-08 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2014-10-29 11:52:38-07:00",
        "text": "I am balloting Abstain: I do completely support Brian's DISCUSS that this document is not in the right place, given the current situation of not having 3GPP involved in this. The IETF cannot IMHO set requirements for other SDO's devices, unless there is explicit input from such SDO in writing such I-D/RFC.",
        "type": "Abstain"
      }
    ],
    "Pete Resnick": [
      {
        "ad": "Pete Resnick",
        "end": "2015-03-27 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Richard Barnes": [
      {
        "ad": "Richard Barnes",
        "end": "2015-03-27 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Sean Turner": [
      {
        "ad": "Sean Turner",
        "end": "2014-03-07 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Spencer Dawkins": [
      {
        "ad": "Spencer Dawkins",
        "end": "2014-10-30 08:28:17-07:00",
        "end_reason": "new_position",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Spencer Dawkins",
        "end": "2015-01-16 11:56:59-08:00",
        "end_reason": "position_updated",
        "start": "2014-10-30 08:28:17-07:00",
        "text": "I'm an Abstain specifically because of the issue other ADs raised about the 3GPP interaction.  I see that the 3GPP liaison manager has involved his 3GPP counterpart, and I'm happy to change my ballot position based on what we get back.",
        "type": "Abstain"
      },
      {
        "ad": "Spencer Dawkins",
        "end": "2019-03-29 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2015-01-16 11:56:59-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Stephen Farrell": [
      {
        "ad": "Stephen Farrell",
        "end": "2017-03-31 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Stewart Bryant": [
      {
        "ad": "Stewart Bryant",
        "end": "2014-03-07 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Ted Lemon": [
      {
        "ad": "Ted Lemon",
        "end": "2015-03-27 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2013-08-18 14:35:53-07:00",
        "text": null,
        "type": "No Record"
      }
    ]
  },
  "doc_name": "rfc7849",
  "evaluation_end": null,
  "evaluation_start": "2013-08-18 14:35:53-07:00"
}