{
  "all_ballots": {
    "Adrian Farrel": [
      {
        "ad": "Adrian Farrel",
        "end": "2012-08-11 23:54:07-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adrian Farrel",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-11 23:54:07-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Barry Leiba": [
      {
        "ad": "Barry Leiba",
        "end": "2012-08-13 16:32:13-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Barry Leiba",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-13 16:32:13-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Benoit Claise": [
      {
        "ad": "Benoit Claise",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Brian Haberman": [
      {
        "ad": "Brian Haberman",
        "end": "2012-08-09 12:18:14-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Brian Haberman",
        "end": "2012-09-25 07:08:19-07:00",
        "end_reason": "discuss_updated",
        "start": "2012-08-09 12:18:14-07:00",
        "text": "I have no problems with the publication of this document, but I do have some issues that I would like to see discussed. 1.  RFC 6204  lists Ole Troan as the editor, but this draft does not have his name listed anywhere (author, editor, or contributor).  Why is that? 2. Requirement W-6 says that a CE router should support a PCP client on the WAN side. Presumably, this is to interact with a PCP server in the ISP's network.  Was there discussion of requiring a PCP server in order to receive requests from hosts on the LAN side? 3. WAA-5 says that a CE router should implement NTP.  Is this strictly as a client?  What about acting as an NTP server for LAN side hosts?  Should the CE router share any NTP servers it learns via the DHCPv6 option with the clients on the LAN side?  If so, how?   RFC 5908 ? 4. Section 4.4 discusses the requirements for transition technologies.  However, it is unclear as to why 6rd and DS-Lite are the only two mentioned.  I would like to see some introductory discussion as to why those two were chosen and others were not.  This does not need to be normative, just a brief outline of how the choices came to be. 5. In section 4.5, requirement S-2 was downgraded from a MUST in  RFC 6204  to a SHOULD.  What was the rationale for that decision?",
        "type": "Discuss"
      },
      {
        "ad": "Brian Haberman",
        "end": "2012-09-25 08:59:57-07:00",
        "end_reason": "discuss_updated",
        "start": "2012-09-25 07:08:19-07:00",
        "text": "I have no problems with the publication of this document, but I do have some issues that I would like to see discussed. 1.  RFC 6204  lists Ole Troan as the editor, but this draft does not have his name listed anywhere (author, editor, or contributor).  Why is that? Given that this document is really meant to reflect what external organizations are requesting/specifying for their CPE devices, I am clearing my DISCUSS points 2 (PCP), 3 (NTP), and 5 (downgraded requirement). 4. Section 4.4 discusses the requirements for transition technologies.  However, it is unclear as to why 6rd and DS-Lite are the only two mentioned.  I would like to see some introductory discussion as to why those two were chosen and others were not.  This does not need to be normative, just a brief outline of how the choices came to be.",
        "type": "Discuss"
      },
      {
        "ad": "Brian Haberman",
        "end": "2012-09-25 09:23:15-07:00",
        "end_reason": "position_updated",
        "start": "2012-09-25 08:59:57-07:00",
        "text": "I have no problems with the publication of this document, but I do have one remaining issue that I would like to see discussed. 1. Fixed in -11 Given that this document is really meant to reflect what external organizations are requesting/specifying for their CE devices, I am clearing my DISCUSS points 2 (PCP), 3 (NTP), and 5 (downgraded requirement). 4. Section 4.4 discusses the requirements for transition technologies.  However, it is unclear as to why 6rd and DS-Lite are the only two mentioned.  I would like to see some introductory discussion as to why those two were chosen and others were not.  This does not need to be normative, just a brief outline of how the choices came to be.  Additionally, the discussion of transition technology lists both 6rd and DS-Lite as SHOULD implement.  Is a CE compliant with this spec if it does not provide any transition technologies?  Is it compliant if it provides only 6to4?",
        "type": "Discuss"
      },
      {
        "ad": "Brian Haberman",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-09-25 09:23:15-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Gonzalo Camarillo": [
      {
        "ad": "Gonzalo Camarillo",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Martin Stiemerling": [
      {
        "ad": "Martin Stiemerling",
        "end": "2012-08-15 07:02:28-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Martin Stiemerling",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-15 07:02:28-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Pete Resnick": [
      {
        "ad": "Pete Resnick",
        "end": "2012-08-21 10:04:15-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Pete Resnick",
        "end": "2012-08-23 15:08:16-07:00",
        "end_reason": "discuss_updated",
        "start": "2012-08-21 10:04:15-07:00",
        "text": "I would prefer to see this document as a Standards Track document. It \"identifies the relevant technical specifications (TSs) and the specific way in which they are to be combined\", it specifies \"particular values or ranges of TS parameters or subfunctions of a TS protocol that must be implemented\", and it specifies \"particular methods of using a technical specification in a restricted 'domain of applicability', such as Internet routers\" (all taken from the definition in 2026 of what goes in a Standards Track document). The document can also clearly evolve over time as we get implementation experience. Making it Standards Track would also given an overt indication of IETF consensus. Informational seems like the wrong status for this document.",
        "type": "Discuss"
      },
      {
        "ad": "Pete Resnick",
        "end": "2012-10-10 19:31:13-07:00",
        "end_reason": "position_updated",
        "start": "2012-08-23 15:08:16-07:00",
        "text": "[Updating given replies from the authors/shepherd] If this document is truly our current best thinking about how to build an IPv6 CE box in order for it to interoperate well with other network components, I would prefer to see this document as a Standards Track document. It \"identifies the relevant technical specifications (TSs) and the specific way in which they are to be combined\", it specifies \"particular values or ranges of TS parameters or subfunctions of a TS protocol that must be implemented\", and it specifies \"particular methods of using a technical specification in a restricted 'domain of applicability', such as Internet routers\" (all taken from the definition in 2026 of what goes in a Standards Track document). The document can also clearly evolve over time as we get implementation experience. Making it Standards Track would also given an overt indication of IETF consensus. However, if this document simply exists to give a list of implementation compliance rules for the IPv6 Ready Logo, it should stay Informational, something about that should be said in the Introduction, and this document should not refer to 2119. If it wants to use MUSTs and SHOULDs for compliance language, it needs to redefine those terms at the top. In particular, my comments below in WPD-3 and 6RD-7 indicate two places where 2119 is probably being used incorrectly to specify implementation choices (in the first case for logging features, in the second case for default configuration), which might indicate that this document is really about implementation compliance and not about interoperability. I'm honestly fine with it either way, but the document needs to be clear about what it's doing, and then to stick to that intention.",
        "type": "Discuss"
      },
      {
        "ad": "Pete Resnick",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-10-10 19:31:13-07:00",
        "text": "I have moved to \"Abstain\" on this document since I really don't think that further discussion is going to be fruitful. If the WG is willing to make the following changes, great. If not, I'm not really willing to argue about it; this is, after all, an update to a document that does almost the same thing. I simply disagree with claiming that the keywords \"are to be interpreted as described in  RFC 2119 \"; they are not being used as 2119 intended, but rather to be industry cudgels as part of protocol policing. So, here are my two suggested changes: Change the first paragraph of section 1 to:    This document defines basic IPv6 features for a residential or small-    office router, referred to as an IPv6 CE router, in order to    establish an industry baseline for features to be implemented on such    a router.    These routers typically also support IPv4. And in section 1.1:    Take careful note: Unlike other IETF documents, the key words \"MUST\",    \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\",    \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are not used as    described in  RFC 2119  [ RFC2119 ]. This document uses these keyword not    strictly for the purpose of interoperability, but rather for the    purpose of establishing industry-common baseline functionality.  As    such, the document points to several other specifications (preferable    in RFC or stable form) to provide additional guidance to implementers    regarding any protocol implementation required to produce a    successful CPE router that interoperates successfully with a    particular subset of currently deploying and planned common IPv6    access networks. 3.1: I think it should be made clearer (either by separating it out or by signposting it a bit better) that this section is more about the current state of deployment than it is about the desired architecture. It caused me a bit of confusion, thinking that this was talking about what was desired, not simply what is.",
        "type": "Abstain"
      }
    ],
    "Ralph Droms": [
      {
        "ad": "Ralph Droms",
        "end": "2012-08-15 05:25:46-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ralph Droms",
        "end": "2012-10-19 07:21:57-07:00",
        "end_reason": "discuss_updated",
        "start": "2012-08-15 05:25:46-07:00",
        "text": "1. The changes in this document are surprisingly small.  Is this document necessary now?  Why are the changes to  RFC 6204  being made now?  Are we going to see another RFC with incremental revisions in another year?  For example, will we see another revision in a few months when more transition technologies are published? 2. W-6 seems premature due to a lack of justification; it seems to be anticipating some future requirement for applications on the CE router that will need PCP. 3. Is it the intention of this document to preclude the use of DHCPv6 PD if neither the M or O bit are set in a received router advertisement? 4. I know I read and approved WPD-5 in  RFC 6204 .  I think I know the intent of WPD-5, but now I'm not sure that the words actually match the intent.  I'd like to discuss the intent to make sure I have it right, and then discuss the specific words to agree that they accurately convey that intent. 5. Why was the new constraint added to WPD-6?  I see that WPD-6 refers to [ I-D.ietf-dhc-dhcpv6-stateful-issues ].  Doesn't that document also address several of the other requirements that have been dropped because of lack of dhc WG consensus; e.g., W-5 (and perhaps WPD-5?). 6. How is the use of 6rd and DS-lite controlled -specifically enabled and disabled?",
        "type": "Discuss"
      },
      {
        "ad": "Ralph Droms",
        "end": "2012-10-30 20:00:20-07:00",
        "end_reason": "position_updated",
        "start": "2012-10-19 07:21:57-07:00",
        "text": "1. (resolved) 2. (resolved) 3. Is it the intention of this document to preclude the use of DHCPv6 PD if neither the M or O bit are set in a received router advertisement? (2012-10-19) More specifically, referencing WPD-4, what is the behavior of the CE router in the case where neither bit is set in a received RA? 4. I know I read and approved WPD-5 in  RFC 6204 .  I think I know the intent of WPD-5, but now I'm not sure that the words actually match the intent.  I'd like to discuss the intent to make sure I have it right, and then discuss the specific words to agree that they accurately convey that intent. (2012-10-19) Now I understand the intent: black-hole packets that have a destination address in the delegated prefix but are not in any prefix assigned out of the delegated prefix by the CE router.  Can you rewrite WPD-5 to be more clear?  Perhaps:   WPD-5:  Any packet received by the CE router with a destination           address in the prefix(es) delegated to the CE router but           not in the set of prefixes assigned by the CE router to the           LAN must be dropped.  In other words, the next hop for the           prefix(es) delegated to the CE router should be the null           destination.  This is necessary to prevent forwarding loops           when some addresses covered by the aggregate are not           reachable [ RFC4632 ].            (a)  The IPv6 CE router SHOULD send an ICMPv6 Destination                 Unreachable message in accordance with Section 3.1 of                 [ RFC4443 ] back to the source of the packet, if the                 packet is to be dropped due to this rule. 5. (cleared) 6. How is the use of 6rd and DS-lite controlled -specifically enabled and disabled? (2012-10-19) For example, does requirement 6RD-1 imply that the CE router is assumed to run 6rd with no mechanism for disabling it?",
        "type": "Discuss"
      },
      {
        "ad": "Ralph Droms",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-10-30 20:00:20-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Robert Sparks": [
      {
        "ad": "Robert Sparks",
        "end": "2012-08-13 11:29:46-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Robert Sparks",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-13 11:29:46-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Ron Bonica": [
      {
        "ad": "Ron Bonica",
        "end": "2012-07-31 14:08:53-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ron Bonica",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-07-31 14:08:53-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Russ Housley": [
      {
        "ad": "Russ Housley",
        "end": "2012-08-12 14:52:46-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Russ Housley",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-12 14:52:46-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Sean Turner": [
      {
        "ad": "Sean Turner",
        "end": "2012-08-14 08:33:01-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Sean Turner",
        "end": "2012-10-29 10:47:39-07:00",
        "end_reason": "position_updated",
        "start": "2012-08-14 08:33:01-07:00",
        "text": "1) s4.?: Forgive me if the answer to these is buried in a referenced RFC: 1.a) Do we need to say something about special names ( draft-cheshire-dnsext-special-names ) resolving to loopback addresses? 1.b) Do we need to say something about reserved, private, loopback and unspecified addresses not being sent out on the WAN? 2) s4.3, L-5: We know the not-so-inside joke that nobody implements DHCPv4 with authentication - can we get that changed and actually require DHCPv6 authentication be implemented?  In 5 years I don't want to hear that yeah, yeah we mandated but nobody implemented it. 3) s4.2, w-5: Are you saying implementations must use  RFC 6355 ?  If so, I think you need a pointer there - otherwise it's unclear what the requirement is. 4) I'm elevating Stephen's last comment (based on the secdir review): Why would it be a good idea to provide the packet filtering features described in  RFC 6092  but only allow these firewall rules to be applied prior to decapsulation. It seems that if the user (who may not be well versed in IP tunneling) turns on some firewall/filtering service in a Customer Edge Router, that what the user probably wants is for the filtering rules to be applied to the packets \"inside\" the tunnel (after decapsulation) and not to packets containing the \"outer\" tunnel header. I would therefore recommend that S-3 be changed to a \"MUST\" instead of a \"SHOULD\".",
        "type": "Discuss"
      },
      {
        "ad": "Sean Turner",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-10-29 10:47:39-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Stephen Farrell": [
      {
        "ad": "Stephen Farrell",
        "end": "2012-08-13 04:13:20-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Stephen Farrell",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-13 04:13:20-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Stewart Bryant": [
      {
        "ad": "Stewart Bryant",
        "end": "2012-08-11 01:55:50-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Stewart Bryant",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-11 01:55:50-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Wesley Eddy": [
      {
        "ad": "Wesley Eddy",
        "end": "2012-08-13 13:03:54-07:00",
        "end_reason": "new_position",
        "start": "2012-07-31 14:08:52-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Wesley Eddy",
        "end": "2012-11-01 08:23:46-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-13 13:03:54-07:00",
        "text": null,
        "type": "No Objection"
      }
    ]
  },
  "doc_name": "rfc7084",
  "evaluation_end": "2012-11-01 08:23:46-07:00",
  "evaluation_start": "2012-07-31 14:08:52-07:00"
}