{
  "all_ballots": {
    "Adrian Farrel": [
      {
        "ad": "Adrian Farrel",
        "end": "2014-09-15 13:13:21-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adrian Farrel",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-15 13:13:21-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alia Atlas": [
      {
        "ad": "Alia Atlas",
        "end": "2014-09-17 13:24:55-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alia Atlas",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-17 13:24:55-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alissa Cooper": [
      {
        "ad": "Alissa Cooper",
        "end": "2014-09-16 13:26:44-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-16 13:26:44-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Barry Leiba": [
      {
        "ad": "Barry Leiba",
        "end": "2014-09-16 16:51:45-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Barry Leiba",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-16 16:51:45-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Benoit Claise": [
      {
        "ad": "Benoit Claise",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Brian Haberman": [
      {
        "ad": "Brian Haberman",
        "end": "2014-09-16 07:15:49-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Brian Haberman",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-16 07:15:49-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Jari Arkko": [
      {
        "ad": "Jari Arkko",
        "end": "2014-09-17 06:12:47-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Jari Arkko",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-17 06:12:47-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Joel Jaeggli": [
      {
        "ad": "Joel Jaeggli",
        "end": "2014-09-01 09:23:58-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Joel Jaeggli",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Kathleen Moriarty": [
      {
        "ad": "Kathleen Moriarty",
        "end": "2014-09-08 13:30:23-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Kathleen Moriarty",
        "end": "2014-09-22 10:24:00-07:00",
        "end_reason": "position_updated",
        "start": "2014-09-08 13:30:23-07:00",
        "text": "Thanks for your work on this draft.  I have some text recommendations to make sure all of the security concerns are covered.  My main points are covered in the proposed text. Security Considerations section: Propose the following change to the first sentence: From: \"TFTP includes no login or access control mechanisms.\" To: \"TFTP includes no authentication, integrity protection, confidentiality, or access control mechanisms.\" Propose text for the first sentence of second paragraph: From: \"TFTP includes no protection against an on-path attacker, care must be    taken in controlling windowsize values according to provider,    requester, and network environment capabilities. \" To: \"TFTP also does not support session encryption and therefore does not protect against an on-path attacker from active (session hijacking) or passive (monitoring) attacks.  Care must be    taken in controlling windowsize values according to provider,    requester, and network environment capabilities. \" I think it's enough to just list monitoring as an example as with TFTP, as it's likely to be a targeted attack and unlikely to be privacy related since it is typically used to do things like update firmware on a local network, etc.  Those attacks fit into the general category of monitoring.",
        "type": "Discuss"
      },
      {
        "ad": "Kathleen Moriarty",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-22 10:24:00-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Martin Stiemerling": [
      {
        "ad": "Martin Stiemerling",
        "end": "2014-09-16 02:05:30-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Martin Stiemerling",
        "end": "2014-09-25 12:00:36-07:00",
        "end_reason": "discuss_updated",
        "start": "2014-09-16 02:05:30-07:00",
        "text": "I have those points to be discussed, while being supportive to get TFTP transmitted files faster.  1)  This document must clearly state that this extension in its current state is solely suitable for well-mananged and monitored environments, but that it is not suitable to be used across the Internet or any unmanaged IP network. An example for a well-managed and monitored environment is a data center network.  The reason for this is that there now back off mechanisms defined to loss.  2) It is not clear to me how this extension is reacting to all kinds of packet loss. Right now, it assumes sporadic losses that require a retransmission of a single or a few packets. However, more heavily losses that require an action from the data sender are not covered. Such a heavily loss could be due to congestion on the network path between both TFTP peers.  In short, it doesn't make sense to keep sending large windows, if the network path is congested. My proposal is to half the window-size on losses and potentially, depending on the desired compelixty, to allow an increase of the window size if there is no loss experienced anymore.  3) What is the error handling for this (Section 3, last paragraph): \"  The rules for determining the final packet are unchanged from    [ RFC1350 ] and [ RFC2348 ].    The reception of a data window with a number of blocks less than the    negotiated windowsize is the final window. If the windowsize is    greater than the amount of data to be transferred, the first window    is the final window.\" You receive a data window with a number of blocks less than the negotiated window but no packet that is shorter than the negotiated block size? 6) It is not clear to me, if the sender is sending a full window out to the network and waits for the successful transmission of the window (or any error), or if the sender keeps constanly sending out new packets, once it does receive an acknowledgment for a non-terminal packet? 5) TFTP is acknowledging each non-terminal packet. I assume this behavior is unchanged also for this extension? If so, smaller windows that slide by each acknowledgment are a nice option to behave well in the network. Especially, as the test results show already a good performance gain with a window size of 8.",
        "type": "Discuss"
      },
      {
        "ad": "Martin Stiemerling",
        "end": "2014-10-02 09:28:28-07:00",
        "end_reason": "discuss_updated",
        "start": "2014-09-25 12:00:36-07:00",
        "text": "[updated according to the discussions during the telechat] I have those points to be discussed, while being supportive to get TFTP transmitted files faster.  1) Waiting for an update of the draft to include Spencer's proposed text.  This document must clearly state that this extension in its current state is solely suitable for well-mananged and monitored environments, but that it is not suitable to be used across the Internet or any unmanaged IP network. An example for a well-managed and monitored environment is a data center network.  The reason for this is that there now back off mechanisms defined to loss.  2) It is not clear to me how this extension is reacting to all kinds of packet loss. Right now, it assumes sporadic losses that require a retransmission of a single or a few packets. However, more heavily losses that require an action from the data sender are not covered. Such a heavily loss could be due to congestion on the network path between both TFTP peers.  In short, it doesn't make sense to keep sending large windows, if the network path is congested. My proposal is to half the window-size on losses and potentially, depending on the desired compelixty, to allow an increase of the window size if there is no loss experienced anymore.  However, I am also sympathizing with the circuit break idea, but I would to get my point 6 addressed first to discuss this. 3) What is the error handling for this (Section 3, last paragraph): \"  The rules for determining the final packet are unchanged from    [ RFC1350 ] and [ RFC2348 ].    The reception of a data window with a number of blocks less than the    negotiated windowsize is the final window. If the windowsize is    greater than the amount of data to be transferred, the first window    is the final window.\" You receive a data window with a number of blocks less than the negotiated window but no packet that is shorter than the negotiated block size? 4) It is not clear to me, if the sender is sending a full window out to the network and waits for the successful transmission of the window (or any error), or if the sender keeps constanly sending out new packets, once it does receive an acknowledgment for a non-terminal packet? This relates to the below question 5).  5) TFTP is acknowledging each non-terminal packet. I assume this behavior is unchanged also for this extension? If so, smaller windows that slide by each acknowledgment are a nice option to behave well in the network. Especially, as the test results show already a good performance gain with a window size of 8. Please update Section 6 to define what the acknowledgment mechanism is, including the difference to the currently defined acknowledgment mechanism. Right now, the Section is just describing one error situtation, but not the ack mechanism.",
        "type": "Discuss"
      },
      {
        "ad": "Martin Stiemerling",
        "end": "2014-10-16 12:57:57-07:00",
        "end_reason": "position_updated",
        "start": "2014-10-02 09:28:28-07:00",
        "text": "[updated based on -12] I have those points to be discussed, while being supportive to get TFTP transmitted files faster.  1) cleared.  2) Updated: It is not clear to me how this extension is reacting to all kinds of packet loss. Right now, it assumes sporadic losses that require a retransmission of a single or a few packets. However, more heavily losses that require an action from the data sender are not covered. Such a heavily loss could be due to congestion on the network path between both TFTP peers.  In short, it doesn't make sense to keep sending large windows, if the network path is congested. However, I am also sympathizing with the circuit break idea, but I would to get my point 5 **really** addressed first to discuss this. 3) moved to comments section.  4) cleared.  5) Updated: Please update the formerly Section 6, now Section 4. to define what the acknowledgment mechanism is, including the difference to the currently defined acknowledgment mechanism. Right now, the Section is just describing one error situtation, but not the ack mechanism. It is not enough to point to an example figure in order to define normative behavior in a standards document.",
        "type": "Discuss"
      },
      {
        "ad": "Martin Stiemerling",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-10-16 12:57:57-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Pete Resnick": [
      {
        "ad": "Pete Resnick",
        "end": "2014-09-15 09:21:51-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Pete Resnick",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-15 09:21:51-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Richard Barnes": [
      {
        "ad": "Richard Barnes",
        "end": "2014-09-17 18:32:20-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Richard Barnes",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-17 18:32:20-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Spencer Dawkins": [
      {
        "ad": "Spencer Dawkins",
        "end": "2014-09-16 10:46:48-07:00",
        "end_reason": "position_updated",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Spencer Dawkins",
        "end": "2014-10-01 12:44:09-07:00",
        "end_reason": "position_updated",
        "start": "2014-09-16 10:46:48-07:00",
        "text": "Thank you, Patrick and Joel, for our pre-ballot conversation. It was helpful, and short-circuited a number of points that didn't need to be part of a DIscuss. And for the record, I’m sympathetic to a desire to decrease boot times in the 21st century, and something like this proposal seems a reasonable way to satisfy that desire. My original Discuss would have overlapped Martin’s significantly, so I’m downsizing to a couple of points that I’d like to talk about, to avoid duplication. First (as my Discuss point) - as Joel has stated in various emails, this document does contain a significant number of “health warnings” about where TFTP is appropriate to use, but they are tilted toward (very real) security concerns. I’d suggest text that also points to concerns about congestion behavior. Perhaps something like this, in Section 4: “The windowsize extension is intended for use in managed networks, where any instances of sustained congestion loss will be noticed and corrected. The choice of an appropriate windowsize value depends on the underlying networking technology and topology, and likely other factors as well. This document does not make recommendations for a specific value, and it allows the operator considerable flexibility, with a maximum windowsize of 65535 blocks. Operators are encouraged to test various values, as shown in Section 5. Operators are encouraged to be conservative when selecting a windowsize, because as the table and chart in Section 5 shows, the benefit of continuing to increase the windowsize is subject to diminishing returns. Operators are encouraged to consider the possibility of events such as power-on/avalanche restarts, when a large number of clients may issue Read Requests to reboot within a small interval of time.” I think I'm capturing points that we've chatted about in e-mail already, But please rephrase as appropriate.",
        "type": "Discuss"
      },
      {
        "ad": "Spencer Dawkins",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-10-01 12:44:09-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Stephen Farrell": [
      {
        "ad": "Stephen Farrell",
        "end": "2014-09-16 15:30:50-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Stephen Farrell",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-09-16 15:30:50-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Ted Lemon": [
      {
        "ad": "Ted Lemon",
        "end": "2014-09-18 04:49:43-07:00",
        "end_reason": "new_position",
        "start": "2014-09-01 09:23:58-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ted Lemon",
        "end": "2014-11-06 09:53:20-08:00",
        "end_reason": "position_updated",
        "start": "2014-09-18 04:49:43-07:00",
        "text": "I don't know how to implement this based on the spec as written.   In particular, the meaning of the error markers in the error handling section is completely obscure to me.   I've been reading this document and the ones it references over and over again trying to figure out what this means, and maybe I'm just stupid, but I don't get it.   Please describe explicitly what these error marks mean, and what is done in response to them.   I am not convinced that updating the document to explain this will completely resolve this DISCUSS, because I literally do not know what I am missing, but I think it would be a good first step.",
        "type": "Discuss"
      },
      {
        "ad": "Ted Lemon",
        "end": "2014-11-07 12:24:13-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-11-06 09:53:20-08:00",
        "text": null,
        "type": "No Objection"
      }
    ]
  },
  "doc_name": "rfc7440",
  "evaluation_end": "2014-11-07 12:24:13-08:00",
  "evaluation_start": "2014-09-01 09:23:58-07:00"
}