{
  "all_ballots": {
    "Adrian Farrel": [
      {
        "ad": "Adrian Farrel",
        "end": "2012-08-29 08:22:02-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adrian Farrel",
        "end": "2012-10-09 01:49:40-07:00",
        "end_reason": "position_updated",
        "start": "2012-08-29 08:22:02-07:00",
        "text": "I think it is unfortunate that this document does not give any  explanation of why it is desirable to expose the information that is lost during proxying and which the proposed extensions make available. It is normal for work in the IETF to be presented along with some motivations based on utility. While it is quite clear that the proposed mechanism would work to provide the function described, it is a mystery why any proxy would implement it or consider the extension valuable. Given that lack of explanation, I don't understand why the IETF would pursue this work on the Standards Track. This Discuss could be resolved by adding some explanation to the  document. Barry sent a recent email containing some explanation of why a standard approach to this function would be beneficial - that text  would address half of my concern. But the benefits of a standard way of doing something are not the whole answer: I also need to know why *any* way of doing this needs to be documented.",
        "type": "Discuss"
      },
      {
        "ad": "Adrian Farrel",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-10-09 01:49:40-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Barry Leiba": [
      {
        "ad": "Barry Leiba",
        "end": "2012-08-13 12:26:56-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Barry Leiba",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Benoit Claise": [
      {
        "ad": "Benoit Claise",
        "end": "2012-09-06 09:06:35-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Benoit Claise",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-09-06 09:06:35-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Brian Haberman": [
      {
        "ad": "Brian Haberman",
        "end": "2012-08-27 08:13:29-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Brian Haberman",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-27 08:13:29-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Gonzalo Camarillo": [
      {
        "ad": "Gonzalo Camarillo",
        "end": "2012-09-06 01:04:18-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Gonzalo Camarillo",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-09-06 01:04:18-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Martin Stiemerling": [
      {
        "ad": "Martin Stiemerling",
        "end": "2012-08-15 11:07:43-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Martin Stiemerling",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-15 11:07:43-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Pete Resnick": [
      {
        "ad": "Pete Resnick",
        "end": "2012-08-28 07:40:05-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Pete Resnick",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-28 07:40:05-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Ralph Droms": [
      {
        "ad": "Ralph Droms",
        "end": "2012-08-28 12:05:42-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ralph Droms",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-28 12:05:42-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Robert Sparks": [
      {
        "ad": "Robert Sparks",
        "end": "2012-08-29 14:25:52-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Robert Sparks",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-29 14:25:52-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Ron Bonica": [
      {
        "ad": "Ron Bonica",
        "end": "2012-08-27 10:04:53-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ron Bonica",
        "end": "2012-08-29 08:41:45-07:00",
        "end_reason": "position_updated",
        "start": "2012-08-27 10:04:53-07:00",
        "text": null,
        "type": "No Objection"
      },
      {
        "ad": "Ron Bonica",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-29 08:41:45-07:00",
        "text": "upporting Stephen Farrell's position",
        "type": "Abstain"
      }
    ],
    "Russ Housley": [
      {
        "ad": "Russ Housley",
        "end": "2012-08-28 09:50:09-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Russ Housley",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-28 09:50:09-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Sean Turner": [
      {
        "ad": "Sean Turner",
        "end": "2012-08-30 08:00:33-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Sean Turner",
        "end": "2012-09-06 08:38:35-07:00",
        "end_reason": "position_updated",
        "start": "2012-08-30 08:00:33-07:00",
        "text": "NOTE: I'm entering this as a discuss and not as a comment. I support Adrian and Stephen's points. Not entirely sure this actionable, but think we ought to at least talk about it on the call: I'm struggling to figure out why we need to standardize this.  This feels to me like when a draft was just recently floated to standardize TLS proxies (i.e., standardized MITM) - sure we could do that but is really a good idea?",
        "type": "Discuss"
      },
      {
        "ad": "Sean Turner",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-09-06 08:38:35-07:00",
        "text": null,
        "type": "Abstain"
      }
    ],
    "Stephen Farrell": [
      {
        "ad": "Stephen Farrell",
        "end": "2012-08-27 10:32:48-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Stephen Farrell",
        "end": "2012-08-30 07:21:14-07:00",
        "end_reason": "discuss_updated",
        "start": "2012-08-27 10:32:48-07:00",
        "text": "I plan to change my DISCUSS position to an ABSTAIN position after the telechat. Its a DISCUSS for now in case some of the points help to improve something in the meantime. I commented on the privacy aspects of this during IETF LC and while the resulting text (in 8.3) is such that I can accept the outcome of that discussion is as good as we can get, I still have to say this isn't really something that I think we would have developed from-scratch in a WG. With this document, we're standardising something that is the opposite of privacy-friendly, basically just because the existing X-Forwarded-* header fields exist and are used already and anything we developed that was more privacy-friendly wouldn't get deployed.  I'm also not at all clear as to who benefits from standardising this, e.g. see my comments on 7.2 & 8.1 below. That may have been discussed on the apps-discuss list, but I don't recall that so am concerned that we may just be standardising this because someone had the energy to write and process the document. I think the document would be better if it didn't present this as being a good (or unconditionally \"needed\") thing, at least without caveats. For example, I don't think this is \"needed\" by users, but rather more by others. That's mostly a writing-style thing though. What is a \"trusted path\" of proxies, or a \"trusted proxy\"? I think that phrase could just be deleted since there are very few cases where anyone knows of and (equally) trusts all the proxies on a path. I don't think the document defines that well enough for the phrase to be kept. Encouraging addition and modification of header fields like this means that any future HTTP e2e integrity mechanisms will have to be more complex than otherwise, basically about as complex as DKIM (or the DOSETA proposal derived from that). I'm not sure if that might or might not have a bad effect on future work with HTTP. I don't know if that was discussed on the httpbis list or on apps-discuss. Section 4 says proxies MUST ensure the \"correct\" header field is updated but doesn't seem to say exactly how to know which header field is the correct one. 5.4 seems to be standardising a practice that amounts to trying to fool the user-agent into believing that TLS was used end to end when in fact it was not. While this is so widely deployed that its probably pointless to try even discourage, I'm not convinced that a WG would design a standard for a server-side crypto accellerator in this way. I think we'd be more likely to make the middlebox at least visible to the user-agent. 7.2 doesn't seem to me to specify when to preserve the header field and when not to do so. I don't think \"direct consequence\" is something that all implementers will understand in the same way. (If doing whatever you like is fine here, then that calls into question the basis for standardising this in the first place.) 8.1 says this cannot be relied upon. If that's the case then why is it being standardised? Whitelisting proxies is (as the document admits) not a credible mitigation. 8.2 says telling the client about the proxy chain is somehow a bad thing but doesn't justify that. Since a client could find out anyway if they wanted to bother, that seems wrong.  8.2 says to disallow the TRACE request. Is that a change to HTTP? If so, then where was that discussed? Section 9 says only that the expert should ensure that the specification \"address the security and privacy implications of the requested parameter.\" So if I defined a parameter that passed on the precise location of the end-user or the most recent healthcare related URL they've accessed then would that be ok? I think additional instructions are needed as to the acceptable purposes to which such parameters can be put or else perhaps IETF review would in fact be better. Given the field of applicability I would not be surprised if very privacy-invasive parameters were defined in future.",
        "type": "Discuss"
      },
      {
        "ad": "Stephen Farrell",
        "end": "2012-08-30 09:16:16-07:00",
        "end_reason": "position_updated",
        "start": "2012-08-30 07:21:14-07:00",
        "text": "I plan to change my DISCUSS position to an ABSTAIN position after the telechat. Its a DISCUSS for now in case some of the points help to improve something in the meantime. (Updated to add DNT point at the end. No other change) I commented on the privacy aspects of this during IETF LC and while the resulting text (in 8.3) is such that I can accept the outcome of that discussion is as good as we can get, I still have to say this isn't really something that I think we would have developed from-scratch in a WG. With this document, we're standardising something that is the opposite of privacy-friendly, basically just because the existing X-Forwarded-* header fields exist and are used already and anything we developed that was more privacy-friendly wouldn't get deployed.  I'm also not at all clear as to who benefits from standardising this, e.g. see my comments on 7.2 & 8.1 below. That may have been discussed on the apps-discuss list, but I don't recall that so am concerned that we may just be standardising this because someone had the energy to write and process the document. I think the document would be better if it didn't present this as being a good (or unconditionally \"needed\") thing, at least without caveats. For example, I don't think this is \"needed\" by users, but rather more by others. That's mostly a writing-style thing though. What is a \"trusted path\" of proxies, or a \"trusted proxy\"? I think that phrase could just be deleted since there are very few cases where anyone knows of and (equally) trusts all the proxies on a path. I don't think the document defines that well enough for the phrase to be kept. Encouraging addition and modification of header fields like this means that any future HTTP e2e integrity mechanisms will have to be more complex than otherwise, basically about as complex as DKIM (or the DOSETA proposal derived from that). I'm not sure if that might or might not have a bad effect on future work with HTTP. I don't know if that was discussed on the httpbis list or on apps-discuss. Section 4 says proxies MUST ensure the \"correct\" header field is updated but doesn't seem to say exactly how to know which header field is the correct one. 5.4 seems to be standardising a practice that amounts to trying to fool the user-agent into believing that TLS was used end to end when in fact it was not. While this is so widely deployed that its probably pointless to try even discourage, I'm not convinced that a WG would design a standard for a server-side crypto accellerator in this way. I think we'd be more likely to make the middlebox at least visible to the user-agent. 7.2 doesn't seem to me to specify when to preserve the header field and when not to do so. I don't think \"direct consequence\" is something that all implementers will understand in the same way. (If doing whatever you like is fine here, then that calls into question the basis for standardising this in the first place.) 8.1 says this cannot be relied upon. If that's the case then why is it being standardised? Whitelisting proxies is (as the document admits) not a credible mitigation. 8.2 says telling the client about the proxy chain is somehow a bad thing but doesn't justify that. Since a client could find out anyway if they wanted to bother, that seems wrong.  8.2 says to disallow the TRACE request. Is that a change to HTTP? If so, then where was that discussed? Section 9 says only that the expert should ensure that the specification \"address the security and privacy implications of the requested parameter.\" So if I defined a parameter that passed on the precise location of the end-user or the most recent healthcare related URL they've accessed then would that be ok? I think additional instructions are needed as to the acceptable purposes to which such parameters can be put or else perhaps IETF review would in fact be better. Given the field of applicability I would not be surprised if very privacy-invasive parameters were defined in future. The W3C have standardised the DoNotTrack header field. It should be clear whether or not, and if so, how, this header  field interacts with that one.",
        "type": "Discuss"
      },
      {
        "ad": "Stephen Farrell",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-30 09:16:16-07:00",
        "text": "I commented on the privacy aspects of this during IETF LC and while the resulting text (in 8.3) is such that I can accept the outcome of that discussion is as good as we can get, I still have to say this isn't really something that I think we would have developed from-scratch in a WG. With this document, we're standardising something that is the opposite of privacy-friendly, basically just because the existing X-Forwarded-* header fields exist and are used already and anything we developed that was more privacy-friendly wouldn't get deployed.  I'm also not at all clear as to who benefits from standardising this, e.g. see my comments on 7.2 & 8.1 below. That may have been discussed on the apps-discuss list, but I don't recall that so am concerned that we may just be standardising this because someone had the energy to write and process the document. I think the document would be better if it didn't present this as being a good (or unconditionally \"needed\") thing, at least without caveats. For example, I don't think this is \"needed\" by users, but rather more by others. That's mostly a writing-style thing though. What is a \"trusted path\" of proxies, or a \"trusted proxy\"? I think that phrase could just be deleted since there are very few cases where anyone knows of and (equally) trusts all the proxies on a path. I don't think the document defines that well enough for the phrase to be kept. Encouraging addition and modification of header fields like this means that any future HTTP e2e integrity mechanisms will have to be more complex than otherwise, basically about as complex as DKIM (or the DOSETA proposal derived from that). I'm not sure if that might or might not have a bad effect on future work with HTTP. I don't know if that was discussed on the httpbis list or on apps-discuss. Section 4 says proxies MUST ensure the \"correct\" header field is updated but doesn't seem to say exactly how to know which header field is the correct one. 5.4 seems to be standardising a practice that amounts to trying to fool the user-agent into believing that TLS was used end to end when in fact it was not. While this is so widely deployed that its probably pointless to try even discourage, I'm not convinced that a WG would design a standard for a server-side crypto accellerator in this way. I think we'd be more likely to make the middlebox at least visible to the user-agent. 7.2 doesn't seem to me to specify when to preserve the header field and when not to do so. I don't think \"direct consequence\" is something that all implementers will understand in the same way. (If doing whatever you like is fine here, then that calls into question the basis for standardising this in the first place.) 8.1 says this cannot be relied upon. If that's the case then why is it being standardised? Whitelisting proxies is (as the document admits) not a credible mitigation. 8.2 says telling the client about the proxy chain is somehow a bad thing but doesn't justify that. Since a client could find out anyway if they wanted to bother, that seems wrong.  8.2 says to disallow the TRACE request. Is that a change to HTTP? If so, then where was that discussed? Section 9 says only that the expert should ensure that the specification \"address the security and privacy implications of the requested parameter.\" So if I defined a parameter that passed on the precise location of the end-user or the most recent healthcare related URL they've accessed then would that be ok? I think additional instructions are needed as to the acceptable purposes to which such parameters can be put or else perhaps IETF review would in fact be better. Given the field of applicability I would not be surprised if very privacy-invasive parameters were defined in future. The W3C have standardised the DoNotTrack header field. It should be clear whether or not, and if so, how, this header  field interacts with that one. 5.1 says \"some other kind of identifier\" which seems quite loose. 5.5 says widely deployed extensions SHOULD be standardized which is an odd use of 2119. What does \"in a sensible way\" mean in 7.4? That seems underspecified.",
        "type": "Abstain"
      }
    ],
    "Stewart Bryant": [
      {
        "ad": "Stewart Bryant",
        "end": "2012-08-28 09:26:58-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Stewart Bryant",
        "end": "2012-10-11 13:16:13-07:00",
        "end_reason": "position_updated",
        "start": "2012-08-28 09:26:58-07:00",
        "text": "I agree with Stephen's concern, and will also be Abstaining. I addition to the privacy concern I am also concerned that this may defeat one of the purposes of proxies, which is to defeat geopriv. I therefore think that the least that needs to happen is that the feature MUST be off by default, and that there should be an element of the protocol that allows the user to (silently) specify that the proxy must not apply this feature.",
        "type": "Discuss"
      },
      {
        "ad": "Stewart Bryant",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-10-11 13:16:13-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Wesley Eddy": [
      {
        "ad": "Wesley Eddy",
        "end": "2012-08-30 06:29:20-07:00",
        "end_reason": "new_position",
        "start": "2012-08-13 12:26:56-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Wesley Eddy",
        "end": "2012-10-12 08:38:38-07:00",
        "end_reason": "evaluation_closed",
        "start": "2012-08-30 06:29:20-07:00",
        "text": null,
        "type": "Abstain"
      }
    ]
  },
  "doc_name": "rfc7239",
  "evaluation_end": "2012-10-12 08:38:38-07:00",
  "evaluation_start": "2012-08-13 12:26:56-07:00"
}