{
  "all_ballots": {
    "Adrian Farrel": [
      {
        "ad": "Adrian Farrel",
        "end": "2014-12-01 07:44:10-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adrian Farrel",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-01 07:44:10-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alia Atlas": [
      {
        "ad": "Alia Atlas",
        "end": "2014-12-04 07:43:34-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alia Atlas",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-04 07:43:34-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alissa Cooper": [
      {
        "ad": "Alissa Cooper",
        "end": "2014-12-02 15:03:40-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-02 15:03:40-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Barry Leiba": [
      {
        "ad": "Barry Leiba",
        "end": "2014-11-22 23:36:08-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Barry Leiba",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-11-22 23:36:08-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Benoit Claise": [
      {
        "ad": "Benoit Claise",
        "end": "2014-11-19 11:18:29-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Benoit Claise",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Brian Haberman": [
      {
        "ad": "Brian Haberman",
        "end": "2014-12-02 06:02:38-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Brian Haberman",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-02 06:02:38-08:00",
        "text": "Like my commentary on \"requirements documents\", I don't see the value in publishing use cases as standalone RFCs. I would rather see these maintained in a wiki or living I-D and either not published or published as an appendix to the corresponding protocol specification. That being said, I will not stand in the way of this document.",
        "type": "Abstain"
      }
    ],
    "Jari Arkko": [
      {
        "ad": "Jari Arkko",
        "end": "2014-12-04 05:29:13-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Jari Arkko",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-04 05:29:13-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Joel Jaeggli": [
      {
        "ad": "Joel Jaeggli",
        "end": "2014-12-01 08:15:28-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Joel Jaeggli",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-01 08:15:28-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Kathleen Moriarty": [
      {
        "ad": "Kathleen Moriarty",
        "end": "2014-12-03 07:09:27-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Kathleen Moriarty",
        "end": "2015-02-12 04:57:59-08:00",
        "end_reason": "position_updated",
        "start": "2014-12-03 07:09:27-08:00",
        "text": "The draft is well written and easy to read, thank you for that. I just have one concerns I'd like to chat about: Section 3.1, second to last paragraph This discusses the probes nicely in terms of privacy concerns, but leaves out the security concerns that have resulted in any type of probe traffic being blocked in the past.  If you are going to leave the privacy concerns in this section, you should also have the security concerns with network mapping and the ability to use this information to assess open ports as well as path information that could be used in the first case to attack/compromise a host or for denial of service attacks for the first and second case.  Path information is mentioned in 3.3, so perhaps the DoS mention would be better there and the general security along with the privacy in section 3.1. Later section 5 mentioned the use of an app to gather information from the end user as opposed to their gateway.  Security and privacy considerations should be mentioned here as well since they differ from the the probe scenario.  I would not recommend going in depth on this topic as this is just the use case document, but rather mentioning it.  It would be out-of-scope to get to deep into application security and protections from compromise or the ability to gather privacy information about the user patterns.  A high level statement of those concerns is enough (IMO) and can get addressed in the solution documents.  Apps and desktop tools can be directly associated with a user as opposed to a home and can lead to desktop compromise, so this is different than the previously mentioned privacy concerns in section 3.  I am aware that these types of services are available today via web pages and is up to the user to initiate. Section 7 First bullet I'd keep DoS attacks restricted to the degradation of service and have the points on privacy and business confidentiality listed separately as merging them confusing the points and attack vectors.  Both can potentially use information gathered from the probes or the actual management station itself, but in different ways, this isn't clear from the bullet.  The DoS could be launched directly from the management station or information about the network and path to hosts could be used to launch a targeted DoS attack.  The accuracy of the measurement system mentioned in the last part of the bullet makes sense combined with the Dos Attack. For privacy, you could collect patterns of use to understand user behavior (already in bullet 2).  Additionally, one could use the information gathered from probes to determine open ports and potential vulnerabilities that could be used to compromise the end point (security concern).   For business confidentiality, I'm not sure what you mean here.  Is this referring to an ability to gather endpoint information to monitor along paths for a business?  I would assume that the probe traffic will be designed to include innocuous information and will just be used for measurement data. It looks as is the SecDir reviewer had similar concerns with the connections between points made in bullet one, so it would be good to fix this and I hope my above explanation is enough to help you adjust the text and add the additional considerations.  I'm happy to help with the text if needed.  The suggested text to the SecDir review is helpful, but would need to change to address the additional concerns I raised (thanks for your work on that with Hannes!). http://trac.tools.ietf.org/area/ops/trac/wiki/mib-security The SecDir review had a few other good points for bullet 6 that you have addressed with proposed text and your proposed text is included here for tracking purposes: Part of Hannes' request:  * prevent unauthorized access to collected measurement data,  * give users the ability to view collected data,  * give users the ability to exert control over sharing, and  * enforce retention periods. ** Editor's proposed text on all points for bullet 6: 6. a measurement system that does not indicate who is responsible for the collection and processing of personal data and who is responsible for fulfilling the rights of users. The responsible party (often termed the \"data controller\") should, as good practice, consider issues such as defining:- the purpose for which the data is collected and used; how the data is stored, accessed, and processed; how long it is retained for; and how the end user can view, update, and even delete their personal data. If anonymised personal data is shared with a third party, the data controller should consider the possibility that the third party can de-anonymise it by combining it with other information.",
        "type": "Discuss"
      },
      {
        "ad": "Kathleen Moriarty",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2015-02-12 04:57:59-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Martin Stiemerling": [
      {
        "ad": "Martin Stiemerling",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Pete Resnick": [
      {
        "ad": "Pete Resnick",
        "end": "2014-12-03 23:13:13-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Pete Resnick",
        "end": "2015-02-10 21:19:41-08:00",
        "end_reason": "position_updated",
        "start": "2014-12-03 23:13:13-08:00",
        "text": "In the end, I'm not going to stand in the way of this document if there is consensus on its content; it is just Informational. But on our agenda, we are specifically asked regarding Informational documents: \"Is this document a reasonable contribution to the area of Internet engineering which it covers?\" And I'd like to take a moment to DISCUSS that question. There's a significant amount of the discussion of the ISP Use Case that contains a lot of fluff about business and operational models that I think probably doesn't belong in an IETF document, though it's nothing out of hand. But I'm having some real trouble with some of the discussion on the Regulator Use Case. Some examples: 2.2 Regulator Use Case    Regulators in jurisdictions around the world are responding to    consumers' adoption of Internet access services for traditional    telecommunications and media services by promoting competition among    providers of electronic communications, to ensure that users derive    maximum benefit in terms of choice, price, and quality.    Competition is more effective with better information, so some    regulators have developed large-scale measurement programs. For    example, programs such as the U.S. Federal Communications    Commission's (FCC) Measuring Broadband America (MBA)...     4.1 Promoting competition through transparency    Competition plays a vital role in regulation of the electronic    communications markets. For competition to successfully discipline    operators' behavior in the interests of their customers, end users    must be fully aware of the characteristics of the ISPs' access    offers. In some jurisdictions regulators mandate that transparent    information imade available about service offers.        [...] 4.2 Promoting broadband deployment    Governments sometimes set strategic goals for high-speed broadband    penetration as an important component of the economic, cultural and    social development of the society. To evaluate the effect of the    stimulated growth over time, broadband Internet access take-up and    penetration of high-speed access can be monitored through measurement    campaigns.    An example of such an initiative is the \"Digital Agenda for Europe\"... It seems completely inappropriate for an Internet *Engineering* Task Force Working Group to be making proclamations about economic competition and the merits (and no notable demerits!) thereof, talking about competitions's \"vital role in the regulation of electronic communications markets\", and touting programs for \"economic, cultural and social development of the society.\" I think it's a bit unseemly, and at some level (and certainly for folks from different cultures) potentially offensive. (And I haven't mentioned the whole net neutrality discussion that Alissa points out.) Is this really appropriate material for an IETF consensus document? I can see it as an IAB document, I can see it as an independent submission, but as an IETF WG document? I'd really like to hear other IESG members' opinions on this. As I said, in the end I won't stand in the way, but before I ABSTAIN, I'd like to hear what others think.",
        "type": "Discuss"
      },
      {
        "ad": "Pete Resnick",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2015-02-10 21:19:41-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Richard Barnes": [
      {
        "ad": "Richard Barnes",
        "end": "2014-12-03 19:29:40-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Richard Barnes",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-03 19:29:40-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Spencer Dawkins": [
      {
        "ad": "Spencer Dawkins",
        "end": "2014-12-04 08:14:24-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Spencer Dawkins",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-04 08:14:24-08:00",
        "text": " have the same concerns Pete has, but since he's already a Discuss, I don't need to be ...",
        "type": "Abstain"
      }
    ],
    "Stephen Farrell": [
      {
        "ad": "Stephen Farrell",
        "end": "2014-12-04 05:53:34-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Stephen Farrell",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-04 05:53:34-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Ted Lemon": [
      {
        "ad": "Ted Lemon",
        "end": "2014-12-04 06:20:34-08:00",
        "end_reason": "new_position",
        "start": "2014-11-19 11:18:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ted Lemon",
        "end": "2015-02-13 06:40:36-08:00",
        "end_reason": "evaluation_closed",
        "start": "2014-12-04 06:20:34-08:00",
        "text": null,
        "type": "No Objection"
      }
    ]
  },
  "doc_name": "rfc7536",
  "evaluation_end": "2015-02-13 06:40:36-08:00",
  "evaluation_start": "2014-11-19 11:18:29-08:00"
}