{
  "all_ballots": {
    "Adam Roach": [
      {
        "ad": "Adam Roach",
        "end": "2018-04-04 21:57:32-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adam Roach",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-04 21:57:32-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alexey Melnikov": [
      {
        "ad": "Alexey Melnikov",
        "end": "2018-04-03 08:23:14-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alexey Melnikov",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-03 08:23:14-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alissa Cooper": [
      {
        "ad": "Alissa Cooper",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Alvaro Retana": [
      {
        "ad": "Alvaro Retana",
        "end": "2018-04-03 02:29:19-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-03 02:29:19-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Ben Campbell": [
      {
        "ad": "Ben Campbell",
        "end": "2018-04-03 19:26:20-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ben Campbell",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-03 19:26:20-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Benjamin Kaduk": [
      {
        "ad": "Benjamin Kaduk",
        "end": "2018-04-04 13:21:39-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Benjamin Kaduk",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-04 13:21:39-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Deborah Brungard": [
      {
        "ad": "Deborah Brungard",
        "end": "2018-04-03 12:42:46-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Deborah Brungard",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-03 12:42:46-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Eric Rescorla": [
      {
        "ad": "Eric Rescorla",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Ignas Bagdonas": [
      {
        "ad": "Ignas Bagdonas",
        "end": "2018-04-03 03:12:11-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ignas Bagdonas",
        "end": "2018-04-03 03:48:30-07:00",
        "end_reason": "discuss_updated",
        "start": "2018-04-03 03:12:11-07:00",
        "text": " have significant concerns about the practical usability of this proposed model.",
        "type": "Discuss"
      },
      {
        "ad": "Ignas Bagdonas",
        "end": "2018-04-03 04:09:30-07:00",
        "end_reason": "discuss_updated",
        "start": "2018-04-03 03:48:30-07:00",
        "text": "I have significant concerns about the practical usability of this proposed model. The intended decoupling of fabric implementation properties (what is termed as \"underlay network infrastructure\" in the document) and its topology seems to be contradicting to general operational practices of fabric based networks. It is generally true for the context of the overlay but that is not what the document seems to be focusing on. Fabric defines and implements the underlay, not the other way around.  The document does not contain a sufficient description of the logic of the model itself, the reasons for choices made for representation of types and attributes, and at the same time descriptions in modules are single lines that do not add clarification beyond being copies of leaf names. Either there needs to be a section that describes the logic of the model and how it relates to other models, also including examples, or module description fields need to have enough content to be able to have equivalent understanding of model intent and operation. Both are strongly encouraged, as descriptions have value of itself for being a reference for use, and model description is needed for understanding how this particular model fits into the larger hierarchy. network management does not end at the boundary of the single domain-specific model.  Why TE topology model is not sufficient for modelling the representation of DC fabric?  How this model could be used for representing more than two stage fabrics that are in wide deployment?  Limiting port bandwidth to a fixed rate is too restrictive. The model as specified already does not cover a set of port speeds that are in wide deployment.",
        "type": "Discuss"
      },
      {
        "ad": "Ignas Bagdonas",
        "end": "2018-04-03 04:14:15-07:00",
        "end_reason": "discuss_updated",
        "start": "2018-04-03 04:09:30-07:00",
        "text": "I have significant concerns about the practical usability of this proposed model as it is specified now.  The intended decoupling of fabric implementation properties (what is termed as \"underlay network infrastructure\" in the document) and its topology seems to be contradicting to general operational practices of fabric based networks. It is generally true for the context of the overlay but that is not what the document seems to be focusing on. Fabric defines and implements the underlay, not the other way around.  The document does not contain a sufficient description of the logic of the model itself, the reasons for choices made for representation of types and attributes, and at the same time descriptions in modules are single lines that do not add clarification beyond being copies of leaf names. Either there needs to be a section that describes the logic of the model and how it relates to other models, also including examples, or module description fields need to have enough content to be able to have equivalent understanding of model intent and operation. Both are strongly encouraged, as descriptions have value of itself for being a reference for use, and model description is needed for understanding how this particular model fits into the larger hierarchy. network management does not end at the boundary of the single domain-specific model.  Why TE topology model is not sufficient for modelling the representation of DC fabric?  How this model could be used for representing more than two stage fabrics that are in wide deployment?  Limiting port bandwidth to a fixed rate is too restrictive. The model as specified already does not cover a set of port speeds that are in wide deployment. How would a device that has more than a single role in the fabric be represented?  Service capabilities as they are described belong to the overlay context while they are called device capabilities. Are those the only possible service capabilities? What is the effect of configuring those capabilities?  What is compose-fabric RPC? The document does not define any RPCs.  What is policy driven traffic behavior?  Looking at the history of the document from the individual submission time and the comments received, it seems that the point fixes to the text went in to cover the specific comments but not to address the broader scope of comments. The document would definitely benefit from a major rewrite clarifying the logic behind the decisions made, aligning more with the operational practice of fabric based network design and deployment, and bringing the content in YANG modules to be self-describing.",
        "type": "Discuss"
      },
      {
        "ad": "Ignas Bagdonas",
        "end": "2018-04-03 04:30:12-07:00",
        "end_reason": "discuss_updated",
        "start": "2018-04-03 04:14:15-07:00",
        "text": "I have significant concerns about the practical usability of this proposed model as it is specified now.  The intended decoupling of fabric implementation properties (what is termed as \"underlay network infrastructure\" in the document) and its topology seems to be contradicting to general operational practices of fabric based networks. It is generally true for the context of the overlay but that is not what the document seems to be focusing on. Fabric defines and implements the underlay, not the other way around.  The document does not contain a sufficient description of the logic of the model itself, the reasons for choices made for representation of types and attributes, and at the same time descriptions in modules are single lines that do not add clarification beyond being copies of leaf names. Either there needs to be a section that describes the logic of the model and how it relates to other models, also including examples, or module description fields need to have enough content to be able to have equivalent understanding of model intent and operation. Both are strongly encouraged, as descriptions have value of itself for being a reference for use, and model description is needed for understanding how this particular model fits into the larger hierarchy. network management does not end at the boundary of the single domain-specific model.  Why TE topology model is not sufficient for modelling the representation of DC fabric? Why is DC fabric network topology special compared to any generic fabric based topology? How this model could be used for representing more than two stage fabrics that are in wide deployment?  Limiting port bandwidth to a fixed rate is too restrictive. The model as specified already does not cover a set of port speeds that are in wide deployment. How would a device that has more than a single role in the fabric be represented?  Service capabilities as they are described belong to the overlay context while they are called device capabilities. Are those the only possible service capabilities? What is the effect of configuring those capabilities?  What is compose-fabric RPC? The document does not define any RPCs.  What is policy driven traffic behavior?  Looking at the history of the document from the individual submission time and the comments received, it seems that the point fixes to the text went in to cover the specific comments but not to address the broader scope of comments. The document would definitely benefit from a major rewrite clarifying the logic behind the decisions made, aligning more with the operational practice of fabric based network design and deployment, and bringing the content in YANG modules to be self-describing.",
        "type": "Discuss"
      },
      {
        "ad": "Ignas Bagdonas",
        "end": "2018-04-03 04:33:34-07:00",
        "end_reason": "discuss_updated",
        "start": "2018-04-03 04:30:12-07:00",
        "text": "I have significant concerns about the practical usability of this proposed model as it is specified now.  The intended decoupling of fabric implementation properties (what is termed as \"underlay network infrastructure\" in the document) and its topology seems to be contradicting to general operational practices of fabric based networks. It is generally true for the context of the overlay but that is not what the document seems to be focusing on. Fabric defines and implements the underlay, not the other way around.  The document does not contain a sufficient description of the logic of the model itself, the reasons for choices made for representation of types and attributes, and at the same time descriptions in modules are single lines that do not add clarification beyond being copies of leaf names. Either there needs to be a section that describes the logic of the model and how it relates to other models, also including examples, or module description fields need to have enough content to be able to have equivalent understanding of model intent and operation. Both are strongly encouraged, as descriptions have value of itself for being a reference for use, and model description is needed for understanding how this particular model fits into the larger hierarchy. Network management does not end at the boundary of the single domain-specific model, it is important to build it into a whole system.  Why TE topology model is not sufficient for modelling the representation of DC fabric? Why is DC fabric network topology special compared to any generic fabric based topology? How this model could be used for representing more than two stage fabrics that are in wide deployment?  Limiting port bandwidth to a fixed rate is too restrictive. The model as specified already does not cover a set of port speeds that are in deployment. How would a device that has more than a single role in the fabric be represented?  Service capabilities as they are described belong to the overlay context while they are called device capabilities. Are those the only possible service capabilities? What is the effect of configuring those capabilities?  What is compose-fabric RPC? The document does not define any RPCs.  What is policy driven traffic behavior? Is there the only one policy that fits all possible deployment scenarios?  Looking at the history of the document from the individual submission time and the comments received, it seems that the point fixes to the text went in to cover the specific comments but not to address the broader scope of comments. The document would definitely benefit from a major rewrite clarifying the logic behind the decisions made, aligning more with the operational practice of fabric based network design and deployment, and bringing the content in YANG modules to be self-describing.",
        "type": "Discuss"
      },
      {
        "ad": "Ignas Bagdonas",
        "end": "2018-11-25 11:59:08-08:00",
        "end_reason": "position_updated",
        "start": "2018-04-03 04:33:34-07:00",
        "text": "I have concerns about the practical usability of this proposed model as it is specified now.  The intended decoupling of fabric implementation properties (what is termed as \"underlay network infrastructure\" in the document) and its topology seems to be contradicting to general operational practices of fabric based networks. It is generally true for the context of the overlay but that is not what the document seems to be focusing on. Fabric defines and implements the underlay, not the other way around.  The document does not contain a sufficient description of the logic of the model itself, the reasons for choices made for representation of types and attributes, and at the same time descriptions in modules are single lines that do not add clarification beyond being copies of leaf names. Either there needs to be a section that describes the logic of the model and how it relates to other models, also including examples, or module description fields need to have enough content to be able to have equivalent understanding of model intent and operation. Both are strongly encouraged, as descriptions have value of itself for being a reference for use, and model description is needed for understanding how this particular model fits into the larger hierarchy. Network management does not end at the boundary of the single domain-specific model, it is important to build it into a whole system.  Why TE topology model is not sufficient for modelling the representation of DC fabric? Why is DC fabric network topology special compared to any generic fabric based topology? How this model could be used for representing more than two stage fabrics that are in wide deployment?  Limiting port bandwidth to a fixed rate is too restrictive. The model as specified already does not cover a set of port speeds that are in deployment. How would a device that has more than a single role in the fabric be represented?  Service capabilities as they are described belong to the overlay context while they are called device capabilities. Are those the only possible service capabilities? What is the effect of configuring those capabilities?  What is compose-fabric RPC? The document does not define any RPCs.  What is policy driven traffic behavior? Is there the only one policy that fits all possible deployment scenarios?  Looking at the history of the document from the individual submission time and the comments received, it seems that the point fixes to the text went in to cover the specific comments but not to address the broader scope of comments. The document would definitely benefit from a major rewrite clarifying the logic behind the decisions made, aligning more with the operational practice of fabric based network design and deployment, and bringing the content in YANG modules to be self-describing.",
        "type": "Discuss"
      },
      {
        "ad": "Ignas Bagdonas",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-11-25 11:59:08-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Martin Vigoureux": [
      {
        "ad": "Martin Vigoureux",
        "end": "2018-04-02 13:47:21-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Martin Vigoureux",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Mirja Kuhlewind": [
      {
        "ad": "Mirja Kuhlewind",
        "end": "2018-04-04 10:59:28-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Mirja Kuhlewind",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-04 10:59:28-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Spencer Dawkins": [
      {
        "ad": "Spencer Dawkins",
        "end": "2018-04-02 19:54:01-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Spencer Dawkins",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-02 19:54:01-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Suresh Krishnan": [
      {
        "ad": "Suresh Krishnan",
        "end": "2018-04-05 06:24:09-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Suresh Krishnan",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-05 06:24:09-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Terry Manderson": [
      {
        "ad": "Terry Manderson",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Warren Kumari": [
      {
        "ad": "Warren Kumari",
        "end": "2018-04-04 18:04:14-07:00",
        "end_reason": "new_position",
        "start": "2018-04-02 13:47:21-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Warren Kumari",
        "end": "2018-04-04 18:04:58-07:00",
        "end_reason": "comment_updated",
        "start": "2018-04-04 18:04:14-07:00",
        "text": "IIRC, this is the first time I've ever balloted Abstain - \"I oppose this document but understand that others differ and am not going to stand in the way of the others.\" This document doesn't align with my view of what a datacenter fabric is, nor how they are managed - there is sufficient distance that I don't really know where I'd start, and so will simply step aside.",
        "type": "Abstain"
      },
      {
        "ad": "Warren Kumari",
        "end": "2018-11-26 10:28:05-08:00",
        "end_reason": "evaluation_closed",
        "start": "2018-04-04 18:04:58-07:00",
        "text": "IIRC, this is the first time I've ever balloted Abstain - \"I oppose this document but understand that others differ and am not going to stand in the way of the others.\" This document doesn't align with my view of what a datacenter fabric is, nor how they are managed - there is sufficient distance that I don't really know where I'd start, and so will simply step aside. I support Ignas' views - I don't see how this aligns with deployments.",
        "type": "Abstain"
      }
    ]
  },
  "doc_name": "rfc8542",
  "evaluation_end": "2018-11-26 10:28:05-08:00",
  "evaluation_start": "2018-04-02 13:47:21-07:00"
}