{
  "all_ballots": {
    "Adam Roach": [
      {
        "ad": "Adam Roach",
        "end": "2020-03-11 17:48:29-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adam Roach",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-11 17:48:29-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alexey Melnikov": [
      {
        "ad": "Alexey Melnikov",
        "end": "2020-03-10 09:59:13-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alexey Melnikov",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-10 09:59:13-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Alissa Cooper": [
      {
        "ad": "Alissa Cooper",
        "end": "2020-03-03 18:07:48-08:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-03 18:07:48-08:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Alvaro Retana": [
      {
        "ad": "Alvaro Retana",
        "end": "2020-03-11 11:51:34-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2020-03-11 11:52:53-07:00",
        "end_reason": "discuss_updated",
        "start": "2020-03-11 11:51:34-07:00",
        "text": "This is a process DISCUSS.  I don't believe the status of this document as a BCP belonging to  BCP 25  was discussed in the WG or with the IETF community. The Charter for the git WG only explicitly mentions  BCP 9 :    The documents produced by this group will not alter the Internet Standards     Process ( BCP 9 ). They will describe how to work within it. Whether working     groups choose to use GitHub or the documented policies to support their work     will remain entirely at their discretion. However, including this document as a part of  BCP 25  (IETF Working Group Guidelines and Procedures) results in the interpretation that it represents consensus on how WGs should proceed -- and not that the decision \"to use GitHub or the documented policies...[is]...entirely at their discretion.\" My reading of the mailing list is that the current RFC Editor note (in which appending the document to  BCP 25  is requested) was added only after the topic was brought up in the Genart LC review. IOW, both (1) the process of reaching the conclusion that this document belongs in  BCP 25 , and (2) the concept that this document would be part of  BCP 25 , are the subject of my DISCUSS.    I would like for the IESG to discuss this topic.   Not expecting this document to be part of  BCP 25 , or having an explicit discussion with the community about it, would lead me to clear my DISCUSS. ==== [Non blocking comment.  I'm including it here because it is related to the status of the document.] This document would be very good Informational document.  I am not a regular GitHub user (and none of the WGs I'm responsible for use it as part of their process), but I have no reason to doubt that the text represents what is believed to be the best way to use GitHub within the IETF process.  However, the designation as a BCP can create confusion.  [Again, this is a non-blocking comment.]",
        "type": "Discuss"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2020-03-20 11:14:50-07:00",
        "end_reason": "position_updated",
        "start": "2020-03-11 11:52:53-07:00",
        "text": "This is a process DISCUSS.  I don't believe the status of this document as a BCP belonging to  BCP 25  was discussed in the WG or with the IETF community. The Charter for the git WG only explicitly mentions  BCP 9 :    The documents produced by this group will not alter the Internet Standards     Process ( BCP 9 ). They will describe how to work within it. Whether working     groups choose to use GitHub or the documented policies to support their work     will remain entirely at their discretion. However, including this document as a part of  BCP 25  (IETF Working Group Guidelines and Procedures) results in the interpretation that it represents consensus on how WGs should proceed -- and not that the decision \"to use GitHub or the documented policies...[is]...entirely at their discretion.\" My reading of the mailing list is that the current RFC Editor note (in which appending the document to  BCP 25  is requested) was added only after the topic was brought up in the Genart LC review.  [Did I miss the discussion?] IOW, both (1) the process of reaching the conclusion that this document belongs in  BCP 25 , and (2) the concept that this document would be part of  BCP 25 , are the subject of my DISCUSS.    I would like for the IESG to discuss this topic.   Not expecting this document to be part of  BCP 25 , or having an explicit discussion with the community about it, would lead me to clear my DISCUSS. ==== [Non blocking comment.  I'm including it here because it is related to the status of the document.] This document would be very good Informational document.  I am not a regular GitHub user (and none of the WGs I'm responsible for use it as part of their process), but I have no reason to doubt that the text represents what is believed to be the best way to use GitHub within the IETF process.  However, the designation as a BCP can create confusion.  [Again, this is a non-blocking comment.]",
        "type": "Discuss"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-20 11:14:50-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Barry Leiba": [
      {
        "ad": "Barry Leiba",
        "end": "2020-03-08 23:44:41-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Barry Leiba",
        "end": "2020-03-10 06:05:23-07:00",
        "end_reason": "position_updated",
        "start": "2020-03-08 23:44:41-07:00",
        "text": "I have a really simple thing to discuss before I move to a “yes” ballot: — Section 4.1.3 —    Chairs need to assess whether the    arguments offered represent new information or not.  This can require   some discussion to determine accurately.  Resolved issues MUST remain    closed unless there is consensus to reopen an issue. There seems to be an inconsistency here: WGCs decide whether new information has been given, so it would seem that it’s the WGCs who decide that an issue should be reopened.  But then we say there has to be consensus for it.  In addition to that appearing inconsistent, I’m not clear how one would determine whether there’s rough consensus to reopen an issue, if doing so were controversial.",
        "type": "Discuss"
      },
      {
        "ad": "Barry Leiba",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-10 06:05:23-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Benjamin Kaduk": [
      {
        "ad": "Benjamin Kaduk",
        "end": "2020-03-12 00:00:00-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Benjamin Kaduk",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-12 00:00:00-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Deborah Brungard": [
      {
        "ad": "Deborah Brungard",
        "end": "2020-03-11 14:06:10-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Deborah Brungard",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-11 14:06:10-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Eric Vyncke": [
      {
        "ad": "Eric Vyncke",
        "end": "2020-03-10 04:01:56-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Eric Vyncke",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-10 04:01:56-07:00",
        "text": "I abstain with the meaning of \"I oppose this document but understand that others differ and am not going to stand in the way of the others.\" per  https://www.ietf.org/standards/process/iesg-ballots/  as the main issue (see below) cannot easily be fixed. I have also a couple of COMMENTs and I would appreciate an answer to those COMMENTs even if you can freely ignore my main ABSTAIN issue Is there a reason why \"GitHub\" is used rather than simply \"Git\" or similar system ? At least, it is explicit to be the commercial web site \" github.com \". Alternatives such as GitLab and BitBucket are only briefly mentioned.  Section 1.3 has an amazing-to-my-eyes sentences \"This document concentrates primarily on GitHub as it has a large and active community of contributors.  As a result, some content might not be applicable to other similar services.\". In my opinion, if the same reasoning was applied to other topics, the Internet will become centralized into popular applications without innovation.     The document itself is clear, easy to read, and sensible except for the overlapping content with the companion document.  Finally, the reason for my ABSTAIN ballot is that I cannot accept that an IETF document in 2020 proposes to use an IPv4-only commercial web site (see also the IAB statement  https://www.iab.org/2016/11/07/iab-statement-on-ipv6  ). Let's eat our own dog food. Why not having a git repo on the IETF servers? -éric PS: as a side note, I use daily the \"git\" tools sometimes for private use on  github.com  but for professional use on a corporate-run git server. --- Start of COMMENT --- General comment: it appears that the two 'git' documents have very similar content. Was it considered to better split them or merge them? Section 3.2: a private repository is not free AFAIK with  github.com . Which party will pay for those repos ? --- End of COMMENT ---",
        "type": "Abstain"
      }
    ],
    "Ignas Bagdonas": [
      {
        "ad": "Ignas Bagdonas",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Magnus Westerlund": [
      {
        "ad": "Magnus Westerlund",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Martin Vigoureux": [
      {
        "ad": "Martin Vigoureux",
        "end": "2020-03-12 04:00:23-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Martin Vigoureux",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-12 04:00:23-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Mirja Kuhlewind": [
      {
        "ad": "Mirja Kuhlewind",
        "end": "2020-03-10 05:46:24-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Mirja Kuhlewind",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-10 05:46:24-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Roman Danyliw": [
      {
        "ad": "Roman Danyliw",
        "end": "2020-03-11 23:03:22-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Roman Danyliw",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-11 23:03:22-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Suresh Krishnan": [
      {
        "ad": "Suresh Krishnan",
        "end": "2020-03-12 06:29:48-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Suresh Krishnan",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-12 06:29:48-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Warren Kumari": [
      {
        "ad": "Warren Kumari",
        "end": "2020-03-10 10:24:44-07:00",
        "end_reason": "new_position",
        "start": "2020-03-03 18:07:29-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Warren Kumari",
        "end": "2020-03-10 10:45:09-07:00",
        "end_reason": "position_updated",
        "start": "2020-03-10 10:24:44-07:00",
        "text": "I spent a while trying to decide between Abstain and DISCUSS. I'm uncomfortable with much of this document: 1: This a BCP, and strongly implies that this is the \"right\" way for working groups to manage themselves and documents streams. The charter says: \"Whether working groups choose to use GitHub or the documented policies to support their work will remain entirely at their discretion.\" - while the document does let WGs choose, the BCP track strongly implies that this is the \"best\" way. I happen to put documents that I author in git (hosted on GitHub), and use that to collaborate with my co-authors, but this is *our* choice, imposing our working process on others is a mistake - we have used the \"as long at it can be turned into the canonical format we don't care how you make it\" paradigm for a reason. If people create the XML in vim or emacs is, and should be entirely their decision - telling people that the \"right\" editor is vi is wrong - and a BCP does that...  The charter also says: \"The documents produced by this group will not alter the Internet Standards Process ( BCP 9 ). They will describe how to work within it.\" but the document sails very close to the wind in many places - e.g: \"Working Group chairs MAY request a revision of an Internet-Draft being managed on Github at any time, in consultation with document editors.\" It has always been clear that chairs can request revisions to WG documents; this doesn't change it, but mentioning things like this simply muddies the water / makes more places for people to have to check. Section 7 is an example place where is is really dangerous - and I think comes close to trying to change  BCP9 . 2: The focus on GitHub makes my deeply uncomfortable -- I get the argument that it is the standard / best known hosted git provider (and, in my *opinion* the right one for us to use), but there are many places where term \"GitHub\" applies to \"self hosted\" solutions like GitLab / Gitea / etc. This feels very close to the IETF recommending that WG participants sign the blue-sheets with a Bic pen when all we need is some sort of writing implement. Just as one example: \"GitHub facilitates more involved interactions,...\" this is true of gitea, gitlab, bitbucket and many other tools -- calling out GitHub gives one tool prominence and is not appropriate for the IETF to do. 3: We require that all decisions be made on mailing lists - when people happen to use GitHub to collaborate on documents and happen to use the issue tracker to track issues, it is clear that this is just for their personal convenience -- having WG \"owned\" repos *will* lead to instances where decisions get made in the issue tracker, and not communicated tp the mailing list - this will end up with two classes of users: those that keep checking the issue tracker, and those that follow the mailing list and are surprised by the decisions made. 4: git (and GitHub) has a really steep learning curve - if a WG decides to fully jump in and start using GitHub, this (either explicitly or implicitly) disenfranchises people who don't use or want to use git.  5: Moving state (primarily issues) from a personal repo to a WG one when a document is adopted is non-trivial -- \"You can only transfer issues between repositories owned by the same user or organization account. You can't transfer an issue from a private repository to a public repository.\" and they have to be (AFAIK), moved individually - this will likely lead to loss of state (I may also have missed it, but I don't see anywhere in the document that talks about migrating a document / repo from an individual to a WG hosted version, and what should happen). I have a document which moved from hosted at  www.github.com/wkumari/  to  www.github.com/capport-wg/  - this involved administrative annoyance, loss of state, and annoyance - for no benefit that I could see. I think a much much better approach would be have people simple keep the documents in their personal repos and not have the disruption that moving the repo entails.  Don't get me wrong - I like git, and a: host my own gitea instance, b: maintain a few gitlabs and gogs instances, and c: put all of my drafts in GitHub - but I really don't think that the IETF should be implying that this is the \"one true way\" (BCP) (nor do I like the WG hosted model).",
        "type": "Abstain"
      },
      {
        "ad": "Warren Kumari",
        "end": "2020-03-11 17:33:05-07:00",
        "end_reason": "position_updated",
        "start": "2020-03-10 10:45:09-07:00",
        "text": "I originally balloted Abstain, but this is (and has been) bothering me enough that I'm changing it to a discuss. This feels like additional centralization / control / process, without good justification. I happen to use GitHub for my documents (along with discussion / agreement with co-authors), but in personal repos. Our documents include something like: \"[ This document is being collaborated on in Github at  https://github.com/wkumari/ .  The most recent  version of the document, open issues, and so on should all be available there.  The authors gratefully accept pull requests. ]\" This document contains a lot of text about setting up, administering, etc a WG organization / repos -- but there is no good justification (that I could find) on what advantages this has over simply encouraging people use GitHub (because it is easy, and well known), and keeping things in their own repos. If WG documents include a pointer (like above) to the repo, everyone can find it, and we don't need all this. This smacks of scope-creep / chairs having control and process where it a: isn't needed and b: isn't helpful.",
        "type": "Discuss"
      },
      {
        "ad": "Warren Kumari",
        "end": "2020-03-20 09:00:18-07:00",
        "end_reason": "position_updated",
        "start": "2020-03-11 17:33:05-07:00",
        "text": "I still don't love this, but I changed from DISCUSS to Abstain -  https://github.com/ietf-gitwg/using-github/pull/46  ,  https://mailarchive.ietf.org/arch/msg/ietf-and-github/vnXiskU2VGIx8VenEP34GWGfOwM/ I recognize that my opinion does not trump WG / IETF consensus, so I'm holding my nose on this one. While I'm on this soapbox, I'd like to thank the authors for listening to, and trying to address my concerns. I'm uncomfortable with much of this document: 1: This a BCP, and strongly implies that this is the \"right\" way for working groups to manage themselves and documents streams. The charter says: \"Whether working groups choose to use GitHub or the documented policies to support their work will remain entirely at their discretion.\" - while the document does let WGs choose, the BCP track strongly implies that this is the \"best\" way. I happen to put documents that I author in git (hosted on GitHub), and use that to collaborate with my co-authors, but this is *our* choice, imposing our working process on others is a mistake - we have used the \"as long at it can be turned into the canonical format we don't care how you make it\" paradigm for a reason. If people create the XML in vim or emacs is, and should be entirely their decision - telling people that the \"right\" editor is vi is wrong - and a BCP does that...  The charter also says: \"The documents produced by this group will not alter the Internet Standards Process ( BCP 9 ). They will describe how to work within it.\" but the document sails very close to the wind in many places - e.g: \"Working Group chairs MAY request a revision of an Internet-Draft being managed on Github at any time, in consultation with document editors.\" It has always been clear that chairs can request revisions to WG documents; this doesn't change it, but mentioning things like this simply muddies the water / makes more places for people to have to check. Section 7 is an example place where is is really dangerous - and I think comes close to trying to change  BCP9 . 2: The focus on GitHub makes my deeply uncomfortable -- I get the argument that it is the standard / best known hosted git provider (and, in my *opinion* the right one for us to use), but there are many places where term \"GitHub\" applies to \"self hosted\" solutions like GitLab / Gitea / etc. This feels very close to the IETF recommending that WG participants sign the blue-sheets with a Bic pen when all we need is some sort of writing implement. Just as one example: \"GitHub facilitates more involved interactions,...\" this is true of gitea, gitlab, bitbucket and many other tools -- calling out GitHub gives one tool prominence and is not appropriate for the IETF to do. 3: We require that all decisions be made on mailing lists - when people happen to use GitHub to collaborate on documents and happen to use the issue tracker to track issues, it is clear that this is just for their personal convenience -- having WG \"owned\" repos *will* lead to instances where decisions get made in the issue tracker, and not communicated tp the mailing list - this will end up with two classes of users: those that keep checking the issue tracker, and those that follow the mailing list and are surprised by the decisions made. 4: git (and GitHub) has a really steep learning curve - if a WG decides to fully jump in and start using GitHub, this (either explicitly or implicitly) disenfranchises people who don't use or want to use git.  5: Moving state (primarily issues) from a personal repo to a WG one when a document is adopted is non-trivial -- \"You can only transfer issues between repositories owned by the same user or organization account. You can't transfer an issue from a private repository to a public repository.\" and they have to be (AFAIK), moved individually - this will likely lead to loss of state (I may also have missed it, but I don't see anywhere in the document that talks about migrating a document / repo from an individual to a WG hosted version, and what should happen). I have a document which moved from hosted at  www.github.com/wkumari/  to  www.github.com/capport-wg/  - this involved administrative annoyance, loss of state, and annoyance - for no benefit that I could see. I think a much much better approach would be have people simple keep the documents in their personal repos and not have the disruption that moving the repo entails.  Don't get me wrong - I like git, and a: host my own gitea instance, b: maintain a few gitlabs and gogs instances, and c: put all of my drafts in GitHub - but I really don't think that the IETF should be implying that this is the \"one true way\" (BCP) (nor do I like the WG hosted model).",
        "type": "Abstain"
      },
      {
        "ad": "Warren Kumari",
        "end": "2020-03-20 11:26:48-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-20 09:00:18-07:00",
        "text": null,
        "type": "No Objection"
      }
    ]
  },
  "doc_name": "rfc8874",
  "evaluation_end": "2020-03-20 11:26:48-07:00",
  "evaluation_start": "2020-03-03 18:07:29-08:00"
}