{
  "all_ballots": {
    "Adam Roach": [
      {
        "ad": "Adam Roach",
        "end": "2017-09-27 17:29:07-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adam Roach",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-27 17:29:07-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alexey Melnikov": [
      {
        "ad": "Alexey Melnikov",
        "end": "2017-09-27 02:29:47-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alexey Melnikov",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-27 02:29:47-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alia Atlas": [
      {
        "ad": "Alia Atlas",
        "end": "2017-09-22 14:13:47-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alia Atlas",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Alissa Cooper": [
      {
        "ad": "Alissa Cooper",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Alvaro Retana": [
      {
        "ad": "Alvaro Retana",
        "end": "2017-09-26 12:16:14-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-26 12:16:14-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Ben Campbell": [
      {
        "ad": "Ben Campbell",
        "end": "2017-09-27 19:02:27-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ben Campbell",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-27 19:02:27-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Benoit Claise": [
      {
        "ad": "Benoit Claise",
        "end": "2017-09-28 06:54:40-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Benoit Claise",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-28 06:54:40-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Deborah Brungard": [
      {
        "ad": "Deborah Brungard",
        "end": "2017-09-26 08:54:26-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Deborah Brungard",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-26 08:54:26-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Eric Rescorla": [
      {
        "ad": "Eric Rescorla",
        "end": "2017-09-27 20:00:56-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Eric Rescorla",
        "end": "2017-11-06 05:03:07-08:00",
        "end_reason": "position_updated",
        "start": "2017-09-27 20:00:56-07:00",
        "text": "I concur with Kathleen's DISCUSS. To state my view of things: 1. The assumption that the datacenter is a secure environment is not a reasonable one. As Kathleen and Adam both observer, datacenter breaches are common and that is why people are moving towards encryption inside the data center. I see that this draft has text claiming that this is only to be deployed in safe environments, but we know that technologies like this get deployed outside the locations for which we claim they are to be deployed, and there's nothing here to stop that. Moreover, the whole trend towards cloud computing pushes us away from designs in which you can safely talk about single secure zones. 2. The text in S 8.1 about how you might want to use some kind of transport security does not seem sufficient. As above, we know that if we don't specify something, people will deploy this technology in insecure settings without any kind of security. I concur with Kathleen's point that this document should provide built-in security mechanisms rather than just punting to the under-layer. Given that as S 1 makes clear, all these SFs are part of the same administrative domain, this seems like a comparatively less challenging setting. If there is some reason why that's infeasible, that needs to be explained.",
        "type": "Discuss"
      },
      {
        "ad": "Eric Rescorla",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-11-06 05:03:07-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Kathleen Moriarty": [
      {
        "ad": "Kathleen Moriarty",
        "end": "2017-09-26 13:42:48-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Kathleen Moriarty",
        "end": "2017-10-20 13:04:36-07:00",
        "end_reason": "position_updated",
        "start": "2017-09-26 13:42:48-07:00",
        "text": "First, I'd like to thank the authors and WG for your efforts in recent revisions of this draft, it has come a long way.  I still want to poke at the lack of a requirement for either integrity protection on the NSH itself or for MUSTs on protections from the transport encapsulation.  Attacks inside of a data center or single operator domains happen all too often.  The number from 2016 is up 164% as of a statistic I saw earlier today.  We can't srug this off anymore. Security Considerations section: First two sentences say:    NSH is designed for use within operator environments.  As such, it    does not include any mandatory security mechanisms.  I think you intended the first sentence to say, \"within a single operator environment\" as what you have now could be multiple networks managed separately with that statement.  Then for the second sentence, I know you don't have an integrity mechanism mandated, but I really think one should be.  Couldn't the path be altered and not detectable if there is no integrity checking?  This could be used to avoid security protections or to route it inappropriately through a multi-tenant environment.  Sure, the underlying protocol should provide session encryption on application traffic, but there's no reason why security shouldn't have been baked into this protocol as a requirement. From the architecture document, the security considerations section calls attention to possible issues related to lack of integrity checking.  Since no encapsulating transport is specified with required session encryption, and the NSH addition doesn't have integrity protection, how will you meet this architecture requirement from  RFC7665 :   Service Overlay:  Underneath the service function forwarders, the         components that are responsible for performing the transport         forwarding consult the outer-transport encapsulation for         underlay forwarding.  Used transport mechanisms should satisfy         the security requirements of the specific SFC deployment.  These         requirements typically include varying degrees of traffic         separation, protection against different attacks (e.g.,         spoofing, man-in-the-middle, brute-force, or insertion attacks),         and can also include authenticity and integrity checking, and/or         confidentiality provisions, for both the network overlay         transport and traffic it encapsulates. It seems from this text, something should be specified for the transport encapsulation. From the text in the draft under review:     As with many    other protocols, without enhancements, the NSH encapsulation could can be    spoofed    or otherwise modified and is subject to snooping and modification in transit.    However, the deployment scope (as defined in [ RFC7665 ]) of the NSH    encapsulation is limited to a single network administrative domain as    a controlled environment, with trusted devices (e.g., a data center)    hence mitigating the risk of unauthorized manipulation of the    encapsulation headers or metadata. This is in direct conflict with the Service Overlay requirements in the Security Considerations of  RFC7665 . Section 8.1 I'd like to see some MUSTs to address the concerns listed in  RFC7665  for encapsulation requirements or an addition of integrity protection on NSH itself.",
        "type": "Discuss"
      },
      {
        "ad": "Kathleen Moriarty",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-10-20 13:04:36-07:00",
        "text": "Thank you very much for the new security considerations section.  The added text to fully explain the current state as well as the pitfalls of the solution is quite helpful.  The work put into understanding the issues (both from the security side as well as from the architecture/solution limitations) and documenting them was substantial and I hope it helps improve future work.  I do understand that the WG has hurdles to provide integrity protection, but also don't see immediate solutions.  I do appreciate the text that acknowledges this problem and that offers some mitigating options.  While I appreciate the changes, I'd like to see better options going forward in routing area protocols and as such, I will abstain since the security property of integrity is not addressed in this solution.",
        "type": "Abstain"
      }
    ],
    "Mirja Kuhlewind": [
      {
        "ad": "Mirja Kuhlewind",
        "end": "2017-09-27 10:00:40-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Mirja Kuhlewind",
        "end": "2017-10-16 02:37:11-07:00",
        "end_reason": "position_updated",
        "start": "2017-09-27 10:00:40-07:00",
        "text": "I have a couple of comments on the design. I know, as always in IESG review state, it's probably too late to make any changes to the actual header format, therefore most of my comments are actually in the comment section below. I still decided to note them so at least people can consider these points. However, there are a few things that I need clarification for before publication, which I note in this section: 1) Sec 2.2 \"SF/SFF/SFC Proxy/Classifier implementations that do not support SFC    OAM procedures SHOULD discard packets with O bit set, but MAY support    a configurable parameter to enable forwarding received SFC OAM    packets unmodified to the next element in the chain.  Forwarding OAM    packets unmodified by SFC elements that do not support SFC OAM    procedures may be acceptable for a subset of OAM functions, but can    result in unexpected outcomes for others; thus, it is recommended to    analyze the impact of forwarding an OAM packet for all OAM functions    prior to enabling this behavior.  The configurable parameter MUST be    disabled by default.\" This part is really unclear to me and I believe needs to be further specified. Where should this configurable parameter be? In the Context header? Why don't you just use one of the unassigned bit to indicate if an unknown (OAM) packet should be forwarded or not?  Moreover, I also disagree with this text. If there is a bit/a way to indicate if a not supported OAM packet should be forwarded or not, it should just be defined like this, while any considerations if that bit should be set or not depend on the OAM function itself and do not need to be discussed here. Finally, it is not well explained what an OAM packet is at all. Is that a 'fake' packet that is generated by the operator to actively test the (potentially newly configured) SFP? If so, why does a SF need to know if a packet is an OAM packet or not? Usually it's a bad idea to use different kind of traffic for testing compared to what will be used in operations. Please provide more explanation here! 2) section 2.4 \"An SFC-aware SF MUST receive the data semantics first in order to    process the data placed in the mandatory context field.  The data    semantics include both the allocation schema and the meaning of the    included data.  How an SFC-aware SF gets the data semantics is    outside the scope of this specification.\" This is really confusing to me. I think this is what you need an actually data semantics aka type field for in the base header. Or is there an actual reason to not put this information directly in the base header where it is need but instead assuming some magical way this information may take to reach the node? If the assumption is that the SF is configured to know based of the SFI what the content of the context header has to be, you a) need to say that in the draft, and b) that's really error-prone because it's really hard to tell if the conext header actually holds the information that you need or just random crap (of course depending of the expected data type of this information). In short, I think you really need a type field somewhere here. In any case, you really need to explain this more! Also, the text further says: \"An SF or SFC Proxy that does not know the format or semantics of the    Context Header for an NSH with MD Type 1 MUST discard any packet with    such an NSH...\" How does the SFC proxy know that it knows the format or not if there is no type field or identifier that indicates what the format should be? Also, a related question from me: why is the context header present in all types of NSH if there is no use for it defined in this document yet? Why is there no fixed length NSH without a context header then? 3) Section 2.5.1: \"If multiple instances of the same metadata are included in an NSH    packet, but the definition of that context header does not allow for    it, the SFC-aware SF MUST process the first instance and ignore    subsequent instances.\" This seems error prone to me. If the same metadata appears multiple where it should not, that seems clearly like an error case for me. Just using the first one and proceed normally might not be the right thing to do. In any case I think such an occasion should at least be logged. If the multiple instances are just a copy of each other and carry the same information, it's probably okay to use that information and proceed. If the different instances carry different information, it maybe a bit dangerous to just use the first one and ignore others silently. In this case I would rather recommend to drop the packet... 4) In line with the second comment from the tsv-art review (thanks Wes!), I don't really understand why this documents says (sec 6) that there can be multiple next hops for the same SFP or SFs can be traversed in a different order. May understanding (from a quick look at  RFC7665 ) would be that, if those things are needed e.g. for load balancing, then one should define different SFPs and the Classifier must have the knowledge that two SFP are equivalent and select them respectively. The reason why I'm really concerned about this is that usually a number of packets below to a flow and all packets belonging to the same flow just ideally take the same route. But usually only the Classifier has a notion of what a flow is and respectively will assign the SFI to the packets belonging to the same flow. If now any SF on the path can more or less randomly decided to forward packet belong to the same flow to one or another next nodes, I would assume that this is not only a problem for the flow, e.g. reordering, but also for SF itself in many cases.",
        "type": "Discuss"
      },
      {
        "ad": "Mirja Kuhlewind",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-10-16 02:37:11-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Spencer Dawkins": [
      {
        "ad": "Spencer Dawkins",
        "end": "2017-09-26 09:20:18-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Spencer Dawkins",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-26 09:20:18-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Suresh Krishnan": [
      {
        "ad": "Suresh Krishnan",
        "end": "2017-09-28 01:20:45-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Suresh Krishnan",
        "end": "2017-09-28 01:21:30-07:00",
        "end_reason": "discuss_updated",
        "start": "2017-09-28 01:20:45-07:00",
        "text": "* Section 5 I think the fragmentation part is underspecified. Take an example where IPv6 is used as the transport encapsulation. If the packet needs to be fragmented, will the NSH header be duplicated into each fragment? If so, this is new behavior for IP that will treat this like any other payload.",
        "type": "Discuss"
      },
      {
        "ad": "Suresh Krishnan",
        "end": "2017-10-03 08:10:10-07:00",
        "end_reason": "position_updated",
        "start": "2017-09-28 01:21:30-07:00",
        "text": "* Section 5 I think the fragmentation part is underspecified. Take an example where IPv6 is used as the transport encapsulation. If the packet needs to be fragmented, will the NSH header be duplicated into each fragment? If so, this is new behavior for IP that will treat this like any other payload. If not how will the subsequent fragments be treated on the service path?",
        "type": "Discuss"
      },
      {
        "ad": "Suresh Krishnan",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-10-03 08:10:10-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Terry Manderson": [
      {
        "ad": "Terry Manderson",
        "end": "2017-09-27 20:36:39-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Terry Manderson",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-27 20:36:39-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Warren Kumari": [
      {
        "ad": "Warren Kumari",
        "end": "2017-09-27 16:04:17-07:00",
        "end_reason": "new_position",
        "start": "2017-09-22 14:13:47-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Warren Kumari",
        "end": "2017-11-06 08:50:26-08:00",
        "end_reason": "evaluation_closed",
        "start": "2017-09-27 16:04:17-07:00",
        "text": null,
        "type": "No Objection"
      }
    ]
  },
  "doc_name": "rfc8300",
  "evaluation_end": "2017-11-06 08:50:26-08:00",
  "evaluation_start": "2017-09-22 14:13:47-07:00"
}