{
  "all_ballots": {
    "Adam Roach": [
      {
        "ad": "Adam Roach",
        "end": "2017-04-12 17:28:05-07:00",
        "end_reason": "new_position",
        "start": "2017-03-26 00:00:00+00:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adam Roach",
        "end": "2017-04-12 18:03:48-07:00",
        "end_reason": "discuss_updated",
        "start": "2017-04-12 17:28:05-07:00",
        "text": "- There are unresolved and substantive Last Call comments which the document does not address. For example, I have a hard time reading \"Not at all\" as effectively addressing concerns that the document implicitly weakens the critically important principles that  RFC 7258  lays down. While feedback to improve this specific situation has been solicited from Martin, it has been scantly more than a day since that request has been made. I don't think we're in a position to move the document forward with the current slate of unresolved Last Call comments. - The IETF as a whole does not have consensus on the document. For a document with such wide-reaching remit -- spanning network layers 3 through 7 -- the IETF-wide discussion has garnered an unclear mix of support and objection, and at fairly low volume (once we discount personnel directly involved in the progression of the document). If I count correctly, we have support for a document that fills this niche from Badri and Elliot, the most tepid statement of support I've seen in quite a while from Stuart (which itself concedes that the document diverges in tone and content from prior IETF statements on related topics), and rather strong statements of opposition from Martin and Christian. The objections by both Martin and Christian are substantive and structural; and many of the primary concerns they express appear to remain unresolved. I understand the temptation to dismiss many of the objecting comments about structure and tone as editorial in nature; but this document lands squarely in the middle of a policy area in which the IETF (and the IAB in particular) has written extensively and carefully, in at least RFCs 1984, 2804, 7258, and 7754, among probably others that escape my notice at the moment; and this also includes IAB statements on the topic, such as . Due to this factor, I believe that obtaining IETF consensus on tone rather than merely technical content is warranted in this case.",
        "type": "Discuss"
      },
      {
        "ad": "Adam Roach",
        "end": "2017-04-12 19:59:38-07:00",
        "end_reason": "discuss_updated",
        "start": "2017-04-12 18:03:48-07:00",
        "text": "- There are unresolved and substantive Last Call comments which the document does not address. For example, I have a hard time reading \"Not at all\" as effectively addressing concerns that the document implicitly weakens the critically important principles that  RFC 7258  lays down. While feedback to improve this specific situation has been solicited from Martin, it has been scantly more than a day since that request has been made. I don't think we're in a position to move the document forward with the current slate of unresolved Last Call comments. - The IETF as a whole does not have consensus on the document. For a document with such wide-reaching remit -- spanning network layers 3 through 7 -- the IETF-wide discussion has garnered an unclear mix of support and objection, and at fairly low volume (once we discount personnel directly involved in the progression of the document). If I count correctly, we have support for a document that fills this niche from Badri and Elliot, the most tepid statement of support I've seen in quite a while from Stuart (which itself concedes that the document diverges in tone and content from prior IETF statements on related topics), and rather strong statements of opposition from Martin and Christian. The objections by both Martin and Christian are substantive and structural; and many of the primary concerns they express appear to remain unresolved. I understand the temptation to dismiss many of the objecting comments about structure and tone as editorial in nature; but this document lands squarely in the middle of a policy area in which the IETF (and the IAB in particular) has written extensively and carefully, in at least RFCs 1984, 2804, 7258, and 7754, among probably others that escape my notice at the moment; and this also includes IAB statements on the topic, such as . Due to this factor, I believe that obtaining IETF consensus on tone rather than merely technical content is warranted in this case. ____ Addendum: Some of the documents that \"escape[d] my notice\" above include RFCs 1958 and 3274 (and in particular sections 4.1.1 and 4.1.2 of the latter document).",
        "type": "Discuss"
      },
      {
        "ad": "Adam Roach",
        "end": "2018-02-05 17:00:00-08:00",
        "end_reason": "position_updated",
        "start": "2017-04-12 19:59:38-07:00",
        "text": "- There are unresolved and substantive Last Call comments which the document does not address. For example, I have a hard time reading \"Not at all\" as effectively addressing concerns that the document implicitly weakens the critically important principles that  RFC 7258  lays down. While feedback to improve this specific situation has been solicited from Martin, it has been scantly more than a day since that request has been made. I don't think we're in a position to move the document forward with the current slate of unresolved Last Call comments. - The IETF as a whole does not have consensus on the document. For a document with such wide-reaching remit -- spanning network layers 3 through 7 -- the IETF-wide discussion has garnered an unclear mix of support and objection, and at fairly low volume (once we discount personnel directly involved in the progression of the document). If I count correctly, we have support for a document that fills this niche from Badri and Elliot, the most tepid statement of support I've seen in quite a while from Stuart (which itself concedes that the document diverges in tone and content from prior IETF statements on related topics), and rather strong statements of opposition from Martin and Christian. The objections by both Martin and Christian are substantive and structural; and many of the primary concerns they express appear to remain unresolved. I understand the temptation to dismiss many of the objecting comments about structure and tone as editorial in nature; but this document lands squarely in the middle of a policy area in which the IETF (and the IAB in particular) has written extensively and carefully, in at least RFCs 1984, 2804, 7258, and 7754, among probably others that escape my notice at the moment; and this also includes IAB statements on the topic, such as . Due to this factor, I believe that obtaining IETF consensus on tone rather than merely technical content is warranted in this case. ____ Addendum: Some of the documents that \"escape[d] my notice\" above include RFCs 1958 and 3724 (and in particular sections 4.1.1 and 4.1.2 of the latter document).",
        "type": "Discuss"
      },
      {
        "ad": "Adam Roach",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2018-02-05 17:00:00-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alexey Melnikov": [
      {
        "ad": "Alexey Melnikov",
        "end": "2017-03-16 06:43:17-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alexey Melnikov",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-03-16 06:43:17-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alia Atlas": [
      {
        "ad": "Alia Atlas",
        "end": "2017-03-15 17:25:48-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alia Atlas",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-03-15 17:25:48-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Alissa Cooper": [
      {
        "ad": "Alissa Cooper",
        "end": "2017-03-15 06:44:34-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2017-03-15 13:53:01-07:00",
        "end_reason": "discuss_updated",
        "start": "2017-03-15 06:44:34-07:00",
        "text": "I have only made it through Section 2.1.6 of this document, but I'm not sure if I'll have time to read the rest before the telechat, so I'm putting in what I have now for my ballot. My apologies for this. = Section 2.1.6.2 = \"Once the    content is encrypted, the Mobile carrier loses the option to redirect    the traffic leaving the option to block the customer's request and    cause a bad customer experience untill the blocking reason can be    conveyed by some other means.\" If all that is encrypted is the application payload, why does the mobile carrier lose the option of being able to do this based on the 5-tuple? This seems to me to be a false statement, or it is assuming some conditions which need to be made more clear.",
        "type": "Discuss"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2017-04-12 03:11:17-07:00",
        "end_reason": "discuss_updated",
        "start": "2017-03-15 13:53:01-07:00",
        "text": "= Section 2.1.6.2 = \"Once the    content is encrypted, the Mobile carrier loses the option to redirect    the traffic leaving the option to block the customer's request and    cause a bad customer experience untill the blocking reason can be    conveyed by some other means.\" If all that is encrypted is the application payload, why does the mobile carrier lose the option of being able to do this based on the 5-tuple? This seems to me to be a false statement, or it is assuming some conditions which need to be made more clear.",
        "type": "Discuss"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2018-02-08 05:26:34-08:00",
        "end_reason": "position_updated",
        "start": "2017-04-12 03:11:17-07:00",
        "text": "I have cleared my original DISCUSS point from my earlier review -- I get what the text is saying now, although I still think the \"lose the option\" language implies some entitlement to the option in the first place, which seems inappropriate. But given the reviews from Martin Thomson and Christian Huitema, it's not clear to me that this document represents the consensus view of the IETF community. Kathleen's response to Martin reinforces the point that we were discussing in the first ballot cycle, which is that this document is written for and represents operators, not the broader array of Internet interests. Yet the suggestion to state that fact up front in the document was not adopted. Having had some more time to review this document than I had in the previous ballot cycle, I also am finding myself in agreement with significant portions of the reviews from Martin and Christian. Reading their reviews helped crystallize a lot of the difficulty I had in parsing this document the first time around.  I understand the rationale that led to this document being written and I think there is a version of this document that could be written that would achieve the original goals while giving the subject matter a readable, neutral treatment. Such a version would be a useful contribution. But I don't think this document achieves that. In particular, there are four things that I think it would need to do to achieve that: 1. State the analysis in a neutral way. As I had mentioned in one of the email threads for the previous ballot cycle, I believe this document could be written in a neutral way -- e.g., “Service providers currently do X. It is implemented using Y mechanism. Encryption at Z layer breaks current implementations.” -- but it is not. Instead it characterizes many of the practices described as \"optimizations\" or \"features\" or \"enrichment\" and states service providers' claims about what these practices accomplish (e.g., \"maximize QOE\") as facts rather than stating them as the reasons given by service providers for why they engage in the practices. This is why in the previous round I suggested the disclaimer at the top of the document to say that the document is giving a view from service providers; that apparently didn't go anywhere, so the other option is to describe each technique neutrally, or explain with each technique that the characterization of the benefits is from the view of the operator. Martin's comments about being clear about who is benefitting point this out as well. 2. Limit the discussion to techniques presently being affected and those effects. There is a bunch of extemporizing about future possible impacts (e.g., in Sec. 2.7, 4.1.2, 4.1.3.1, 5.7, 7, 8). It's very hard to characterize future implications, who will bear the \"cost\" for what, whether increases in user complaints to various parties are \"worth it,\" etc., in a way that is perceived as neutral by all affected parties. Better not to make predictions if the goal is to give a neutral treatment of network functions being impacted today. 3. Acknowledge the controversy. Many of the practices described in this document are controversial, and have been for a long time. There is nothing wrong with that. I agree with Christian that it would be better to state an understanding of that head-on rather than leave it to the reader to decide whether any particular characterization of something described implies an endorsement of it. This has been done before, even in potentially controversial documents that this document references, e.g.  RFC 3135 . 4. Structure the document in a way that is consistent and logical with minimal repetition. It seems like there are multiple ways that this could be done. Organizing based on use case (per Christian) and then discussing techniques used within each use case is one way; organizing based on technique while mentioning the goals for which each technique is employed is another. At present the document is jumble of these.",
        "type": "Discuss"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2018-02-28 08:36:29-08:00",
        "end_reason": "comment_updated",
        "start": "2018-02-08 05:26:34-08:00",
        "text": "Many thanks for all the effort that has gone in to addressing all the comments from the last IESG review and from the community. I find this version to be much improved from the last time the IESG reviewed it. However, I do not feel that I can support the publication of the document. While the tone has improved in many places and the introduction does a better job of contextualizing the document, the document still contains text in several sections that states service providers' claims about their practices as facts rather than stating them as claims or presenting the practices in a neutral way. This was a point raised in my previous DISCUSS (I've included my previous DISCUSS ballot text below in full for reference). In the previous review round Warren had invited recommendations for places where the tone or choice of words could be made more neutral or balanced, and I provided many detailed suggestions, but a number of those were not adopted. I also realize that the introduction contains much of the disclaimer text we previously hashed out to try to address this, but it doesn't contain all of it. So this is still a major issue for the document, IMO. The document also still extemporizes about future possible impacts, making it hard to come away with a neutral view of their treatment, as I noted in my previous DISCUSS ballot. I support the DISCUSS position held by Ekr. But given the above I don't think it will be fruitful for me to continue to engage on the details of this document, so I'm abstaining. I've included below some of the areas that I still find problematic, as well as some nits. Problematic areas: = Section 2.1.2 = (1) \"Network operators are often the first ones called upon to investigate    application problems\" I still contend that without data to back this up, this claim should not be made, especially for the enterprise context. (2) \"Vendors must be aware that in order for operators to better    troubleshoot and manage networks with increasing amounts of encrypted    traffic, built-in diagnostics and serviceability must be enhanced to    provide detailed logging and debugging capabilities that, when    possible, can reveal cleartext network parameters.\" If I try to paraphrase this it sounds like \"vendors should build in capabilities to decrypt encrypted traffic.\" Was that the intent? = Section 2.2.4 = I agree with Christian Huitema's unresolved comments on this section. In the thread regarding his comments Kathleen said \"we don't want to make general statements that aren't necessarily true\" -- IMO that is what the middle three paragraphs in this section are doing. At a minimum, I think the characterizations about the effects of performance-enhancing proxies needs to be qualified by saying \"some operators find that ...\" rather than stating their effects as fact. = Section 2.2.7 = \"There is work in progress to specify protocols that permit Service    Function Chaining (SFC).\" I don't think it makes sense to have this forward-looking statement when Section 1 states that \"This document describes practices currently used by network operators to manage, operate, and secure their networks.\" I think it makes sense to focus this section on how existing SFC deployments have stopped functioning because of increased use of encrypted traffic, but it seems unfair to claim that some future, yet-to-deployed functionality will be broken. = Section 2.3.2 = \"As a    result, some mobile carriers block customer's encrypted requests,    which is a far less optimal customer experience because the blocking    reason must be conveyed by some other means.\" This could easily be read to imply that sending requests in cleartext is optimal. Overall, the use of the words \"usual,\" \"optimal,\" and \"often\" in this section imply a level of generality that is unwarranted I think.  = Section 5.6 = The implications for SAVI seem speculative unless you can point to SAVI deployments that have been impacted by increased use of encryption. Nits: = Abstract = s/Pervasive Monitoring (PM) attacks on the privacy of Internet users is    of serious concern/Pervasive Monitoring (PM) attacks on the privacy of Internet users are of serious concern/ = Section 2.1.2 = (1) \"Further, the performance of some services can be more efficiently    managed and repaired when information on user transactions is    available to the service provider.  It may be possible to continue    such monitoring activities without clear text access to the    application layers of interest ...\" It's not clear what \"such monitoring\" refers to, since the previous sentence is about performance management and service repair. (2) Is \"User/Service Key Quality Indicators\" a term of art? It seems weird to be capitalized. = Section 2.2.3 = This section seems like it was left in the document by mistake. = Section 2.3 = \"As previously stated, the intent of this document is to    document existing practices, the development of IETF protocols    follows the guiding principles of [ RFC1984 ] and [ RFC2804 ].\" Is that comma supposed to be a period? I'm not following the grammar here. = Section 2.3.1 = s/However, the lack of ability to efficiently manage    endpoints as a service reduces providers' ability to offer parental    control./However, the lack of ability to efficiently manage    endpoints as a service reduces network service providers' ability to offer parental    control./ = Section 4.1.2 = It seems like a single reference to  RFC 8250  would suffice. = Section 7.4 = What is a trusted transit proxy? ---------------------------------------------------------------- Previous DISCUSS ballot text: I have cleared my original DISCUSS point from my earlier review -- I get what the text is saying now, although I still think the \"lose the option\" language implies some entitlement to the option in the first place, which seems inappropriate. But given the reviews from Martin Thomson and Christian Huitema, it's not clear to me that this document represents the consensus view of the IETF community. Kathleen's response to Martin reinforces the point that we were discussing in the first ballot cycle, which is that this document is written for and represents operators, not the broader array of Internet interests. Yet the suggestion to state that fact up front in the document was not adopted. Having had some more time to review this document than I had in the previous ballot cycle, I also am finding myself in agreement with significant portions of the reviews from Martin and Christian. Reading their reviews helped crystallize a lot of the difficulty I had in parsing this document the first time around.  I understand the rationale that led to this document being written and I think there is a version of this document that could be written that would achieve the original goals while giving the subject matter a readable, neutral treatment. Such a version would be a useful contribution. But I don't think this document achieves that. In particular, there are four things that I think it would need to do to achieve that: 1. State the analysis in a neutral way. As I had mentioned in one of the email threads for the previous ballot cycle, I believe this document could be written in a neutral way -- e.g., “Service providers currently do X. It is implemented using Y mechanism. Encryption at Z layer breaks current implementations.” -- but it is not. Instead it characterizes many of the practices described as \"optimizations\" or \"features\" or \"enrichment\" and states service providers' claims about what these practices accomplish (e.g., \"maximize QOE\") as facts rather than stating them as the reasons given by service providers for why they engage in the practices. This is why in the previous round I suggested the disclaimer at the top of the document to say that the document is giving a view from service providers; that apparently didn't go anywhere, so the other option is to describe each technique neutrally, or explain with each technique that the characterization of the benefits is from the view of the operator. Martin's comments about being clear about who is benefitting point this out as well. 2. Limit the discussion to techniques presently being affected and those effects. There is a bunch of extemporizing about future possible impacts (e.g., in Sec. 2.7, 4.1.2, 4.1.3.1, 5.7, 7, 8). It's very hard to characterize future implications, who will bear the \"cost\" for what, whether increases in user complaints to various parties are \"worth it,\" etc., in a way that is perceived as neutral by all affected parties. Better not to make predictions if the goal is to give a neutral treatment of network functions being impacted today. 3. Acknowledge the controversy. Many of the practices described in this document are controversial, and have been for a long time. There is nothing wrong with that. I agree with Christian that it would be better to state an understanding of that head-on rather than leave it to the reader to decide whether any particular characterization of something described implies an endorsement of it. This has been done before, even in potentially controversial documents that this document references, e.g.  RFC 3135 . 4. Structure the document in a way that is consistent and logical with minimal repetition. It seems like there are multiple ways that this could be done. Organizing based on use case (per Christian) and then discussing techniques used within each use case is one way; organizing based on technique while mentioning the goals for which each technique is employed is another. At present the document is jumble of these.",
        "type": "Abstain"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2018-02-28 08:36:29-08:00",
        "text": "hanks for addressing most of my concerns in my previous ballot even though I abstained.",
        "type": "Abstain"
      }
    ],
    "Alvaro Retana": [
      {
        "ad": "Alvaro Retana",
        "end": "2017-03-15 11:09:35-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-03-15 11:09:35-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Ben Campbell": [
      {
        "ad": "Ben Campbell",
        "end": "2017-03-15 19:47:00-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Ben Campbell",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-03-15 19:47:00-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Benoit Claise": [
      {
        "ad": "Benoit Claise",
        "end": "2017-04-12 17:51:58-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Benoit Claise",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-04-12 17:51:58-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Deborah Brungard": [
      {
        "ad": "Deborah Brungard",
        "end": "2017-03-15 13:15:21-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Deborah Brungard",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-03-15 13:15:21-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Eric Rescorla": [
      {
        "ad": "Eric Rescorla",
        "end": "2017-04-11 09:27:23-07:00",
        "end_reason": "new_position",
        "start": "2017-03-26 00:00:00+00:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Eric Rescorla",
        "end": "2018-02-07 21:04:26-08:00",
        "end_reason": "discuss_updated",
        "start": "2017-04-11 09:27:23-07:00",
        "text": "I do not believe that this document represents IETF Consensus, largely for the reasons indicated by Martin Thomson and Christian Huitema on the IETF list recently. Specifically, this document, while perhaps not saying anything actually false, essentially only presents the perspective of operators and service providers. In many cases, those interests are adverse to those of users -- and in many cases encryption is used specifically to prevent operators from providing the \"services\" and \"enhancements\" contemplated by this document.  For these reasons, I don't believe that the uncritical treamtent of these activities presented in this document should be published as an RFC that claims to have IETF Consensus. I have made specific comments below that indicate some of the more serious issues, but the problems here are systematic and require more than simple edits. S 1.    draft includes a collection of    current security and network management functions The functions presented here in many cases go far beyond security and management. For instance, header enrichment is neither, except by stretching the definition of \"management\" to breaking. S 2.    middle boxes were in use to perform functions that range from load    balancing techniques to monitoring for attacks or enabling \"lawful    intercept\", such that described in [ETSI101331] and [CALEA] in the    US. I'm not sure why you are mentioning CALEA here. As far as I can tell, the CALEA requirements only apply to carriers who have access to the keying material.    The loss of access to these fields may    prompt undesirable security practices in order to gain access to the    fields in unencrypted data flows. As Martin Thomson indicates, this feels like a threat. S 2.1. As Martin and Christian indicate, this QUIC material is entirely speculative and extremely controversial and you should remove it.    Additionally, a system that is able to encode the identity of the    pool server in plain text information available in each incoming    packet is able to provide stateless load balancing. This doesn't have to be in plaintext because the pool load balancer has a relationship with the servers. We already have designs for this for QIC.    Current protocols, such as TCP, allow the development of stateless    integrated load balancers by availing such load balancers of    additional plain text information in client-to-server packets.  (In    case of TCP, such information can be encoded by having server-    generated sequence numbers, mss values, lengths of the packet sent,    etc.) How does this help the load balancer direct traffic. S 2.2.    Internet traffic surveys are useful in many well-intentioned \"Well-intentioned\" is pretty tendentious here.    pursuits, such as CAIDA data [CAIDA] and SP network design and    optimization. I'd be interested in hearing which CAIDA studies are impacted by content encryption. Do you have citations? S 2.3.2.1. There are two kinds of caching potentially in play: - Explicit caches - Intercepting caches At this point, what ISPs primarily run is intercepting caches, and there's a lot of evidence that they contribute to bustage and ossification, as well as being a primary tool for ISPs to use to mess with people's traffic in ways that users clearly don't want (ad/tracking injection, etc.).  So, I don't think an IETF consensus document should suggest that we are sad to be breaking them. S 2.3.2.2. The presentation here seems biased given that it does not acknowledge that one of the primary reasons that ISPs do traffic class discrimination is to prioritize favored rather than disfavored traffic, regardless of user preferences. I don't believe that the IETF has taken a position for net neutrality, but I'm also pretty sure we don't have consensus against it. S 2.5.3. Currently, the mobile network service provider redirects the customer    using HTTP redirect to a page which educates the customer on the    reason for the blockage and provide steps to proceed.  Once the HTTP    header and content are encrypted, the Mobile carrier loses the option    to intercept the traffic and perform an HTTP redirect.  With current    solution options, this leaves only the option to block the customer’s    request and cause a bad customer experience until the blocking reason    can be conveyed by some other means. This is pretty tendentious. It's not at all clear to me that the customer thinks that having their traffic intercepted is a better experience. S 2.6.2. Zero-rating is absolutely possible in the face of encryption. Facebook Free Basics supports this. https://info.internet.org/en/blog/2015/09/24/enhancing-security-and-privacy-of-free-basics/ S 2.6.5. Header insertion is also used for tracking and advertising. S 2.7. This should be clearer about the impact of encryption at various layers. Most of the things you want to do here will work fine with HTTPS. S 2.8.    When utilizing increased encryption, application server operators    should expect to be called upon more frequently to diagnose problems Why would this be true? As far as I can tell, pretty much only if they are screwing with the traffic in ways that the user would prefer they not. S 3.3.1.    The general monitoring needs for data replication are described in    this subsection. It's not at all obvious these are needs. S 4.1.1. A lot of these monitoring applications could also be characterized as the employer conducting surveillance on its employees. S 4.2. As far as I know, the MITM techniques used by middleboxes are not described in 7457. You also need to cover the fact that these MITM are a threat to user security because they are often so badly implemented.    Restrictions on traffic to approved sites: Web proxies are sometimes    used to filter traffic, allowing only access to well-known sites    found to be legitimate and free of malware on last check by a proxy    service company.  This type of restriction is usually not noticeable    in a corporate setting, but may be to those in research who are    unable to access colleague’s individual sites or new web sites that    have not yet been screened. I'm not sure why this would be not noticeable in a corporate setting. I, for one, notice it on airplanes. S 5.3. It's pretty odd to talk about phishing without acknowledging that by far the largest anti-phishing platform (Safe Browsing) operates in the client, not be network interception. S 7.1 This entire section is pretty confusing. Issues include: - There is real debate about whether performance-enhancing proxies   really work (see Mathis's comments at IETF). - Content replication needs a lot more than just being able to see   ACKs. - \"trusted\" proxies? Trusted by who? This whole architectural structure of having invisible proxies messing with the transport stream is a total violation of the E2E argument, so I don't see how one could think that describing it as if it were positive can have IETF consensus. I also notice that this section and the sectoin below describe things that a lot of users don't want as \"features\" S 7.3.        Content/Application based Prioritization of Over-the-Top (OTT)        services - each application-type or service has different        delay/loss/throughput expectations, and each type of stream will        be unknown to an edge device if encrypted; this impedes dynamic-        QoS adaptation. I think there's a lot of debate about whether we *want* networks to try to accommodate new traffic classes. This has lead to a lot of problems under the heading of \"ossification\"         While CDNs that de-encrypt flows or split-connection proxy        (similar to split-tcp) could be deployed closer to the edges to        reduce control loop RTT, with transport header encryption, such        CDNs perform optimization functions only for partner client        flows; thus content from Small-Medium Businesses (SMBs) would not        get such CDN benefits. Huh? Lots of SMBs use this kind of CDN. That's how e.g., Cloudflare works. Heck the IETF uses it. S 8.    In the best case scenario, engineers and other innovators would work    to solve the problems at hand in new ways rather than prevent the use    of encryption.  It will take time to devise alternate approaches to    achieve similar goals. Much of the context of this debate is about whether operators not being able to do the things in this document is a problem.    It is well known that national surveillance programs monitor traffic    for terrorism [JNSLP] I concur with Martin's objection to the use of the loaded word \"terrorism\" here. Given  RFC 2804  and the IETF's clear position on protocol design, this discussion of balance between surveillance and user security seems completely outside the IETF consensus.      Open questions: As the use of encryption increases, does passive    monitoring become limited to metadata analysis?  What metadata should    be left in protocols as they evolve to also protect users privacy? Huh? Coming as this does in the context of surveillance, 2804 is clear. It might be the case that there are good reasons to avoid encrypting metadata for the purposes of network monitoring by carriers, but I think the IETF consensus is clearly not to do so to enable surveillance.",
        "type": "Discuss"
      },
      {
        "ad": "Eric Rescorla",
        "end": "2018-02-28 06:53:21-08:00",
        "end_reason": "position_updated",
        "start": "2018-02-07 21:04:26-08:00",
        "text": "I have completely re-reviewed the latest version. First, I want to thank you for toning down some of the material that I was concerned about. Unfortunately, the fundamental concern that motivated my DISCUSS remains: I do not believe that this document matches the consensus of the IETF community. Specifically, this document takes at face value a large number of claims about the necessity/value of certain practices that either are controversial within the IETF or that there is, I believe, rough consensus to be actively bad, and that in many cases, encryption is specifically designed to prevent. I have noted a number of these below, but I do not believe that this is an exhaustive list (going through my previous DISCUSS, I see that I noted a number of these but that still appear to be unaddressed.) DISCUSS    session encryption that deployed more easily instead of no    encryption.     I think I understand what you are saying here, but the term \"breakable\" seems very unfortunate, especially in the context of this document. The only such shift I am aware of that has received acceptance in IETF is one from always requiring fully authenticated encryption to allowing unauthenticated encryption, which you document in the next paragraph. I recognize that there are other perspectives (e.g., those in draft-rhrd) but those are pretty far from IETF consenus. Accordingly, I think you should remove this sentence.    motivation outside of privacy and pervasive monitoring that are    driving end-to-end encryption for these content providers.     This section seems kind of confusing, at least as applied to HTTP. There are three kinds of cache in HTTP: - Reverse proxy caches (the kind CDNs run) - Explicit forward proxy caches - \"Transparent\" intercepting caches The first of these move to HTTPS just fine and that's typically how CDNs do it.  Explicit forward proxy caches are largely going away, but part of the point of this kind of end-to-end encryption is to hide data from those caches.  Transparent intercepting caches that the user didn't opt into are a bad thing, so having them go away is a positive.    document existing practices, the development of IETF protocols    follows the guiding principles of [ RFC1984 ] and [ RFC2804 ].     This is pretty opaque in this context. It should explicitly state that the IETF's position is that we do not engineer for these use cases, not just to cite the RFCs.    based billing, or for other reasons, possibly considered    inappropriate by some.  See  RFC7754  [ RFC7754 ] for a survey of    Internet filtering techniques and motivations.  This section is I don't think this accurately represents the RFC, which makes clear that the IAB consensus is that filtering is bad: \" From a technical perspective, there are no perfect or even good solutions -- there is only least bad.  On that front, we posit that a hybrid approach that combines endpoint-based filtering with network filtering may prove least damaging.  An endpoint may choose to participate in a filtering regime in exchange for the network providing broader unfiltered access.\"    detect or prevent attacks as well as to guarantee service level    expectations.  In some cases, alternate options are available when    encryption is in use, but techniques like that of data leakage     These certainly are use cases, but you really need to acknowledge that it's also a form of user surveillance.    Some DLP tools intercept traffic at the Internet gateway or proxy    services with the ability to man-in-the-middle (MiTM) encrypted    session traffic (HTTP/TLS).  These tools may use key words important    to the enterprise including business sensitive information such as    trade secrets, financial data, personally identifiable information    (PII), or personal health information (PHI).  Various techniques are    used to intercept HTTP/TLS sessions for DLP and other purposes, and    are described in \"Summarizing Known Attacks on TLS and DTLS\"    [ RFC7457 ]. As far as I know, the MITM techniques used by middleboxes are not described in 7457. You also need to cover the fact that these MITM are a threat to user security because they are often so badly implemented. S 5.4. It's pretty odd to talk about phishing without acknowledging that by far the largest anti-phishing platform (Safe Browsing) operates in the client, not be network interception.     The transport header encryption prevents trusted transit proxies.  It    may be that the benefits of such proxies could be achieved by end to     You don't define a \"trusted transit proxy\" so I don't know what this means, and whether they provide any benefit, but this certainly sounds euphemistic. Generally, \"trusted\" is not an adjective we associate with network proxies operated by third parties.    In the best case scenario, engineers and other innovators would work    to solve the problems at hand in new ways rather than prevent the use    of encryption.  As stated in [ RFC7258 ], \"an appropriate balance    (between network management and PM mitigations) will emerge over time    as real instances of this tension are considered.\" Much of the context of this debate is about whether operators not being able to do the things in this document is a problem, and this seems to presume the answer.    This optimization at network edges measurably improves real-time    transmission over long delay Internet paths or networks with large     Do you have a citation for this claim?    Web proxies are sometimes used to filter traffic, allowing only    access to well-known sites found to be legitimate and free of malware    on last check by a proxy service company.  This type of restriction    is usually not noticeable in a corporate setting as the typical    corporate user does not access sites that are not well-known to these    tools, but may be noticeable to those in research who are unable to    access colleague's individual sites or new web sites that have not    yet been screened.  In situations where new sites are required for    access, they can typically be added after notification by the user or    proxy log alerts and review.  Home mail account access may be blocked    in corporate settings to prevent another vector for malware to enter    as well as for intellectual property to leak out of the network.    This method remains functional with increased use of encryption and    may be more effective at preventing malware from entering the    network.  Web proxy solutions monitor and potentially restrict access    based on the destination URL or the DNS name.  A complete URL may be    used in cases where access restrictions vary for content on a    particular site or for the sites hosted on a particular server. If you are filtering on URL and there is HTTPS involved, then you are a MITM, and this is potentially noticeable to end-users. We encounter this regularly when MITM proxies make mistakes in getting into our trust anchor store. Re: 0-rating.    user.  This feature is impacted if encryption hides the details of    the content domain from the network.     Well, maybe. Facebook's zero rating, for instance, is IP-based. https://info.internet.org/en/blog/2015/09/24/enhancing-security-and-privacy-of-free-basics/ S 2.2.2. The presentation here seems biased given that it does not acknowledge that one of the reasons that ISPs do traffic class discrimination is to prioritize favored rather than disfavored traffic, regardless of user preferences. I don't believe that the IETF has taken a position for net neutrality, but I'm also pretty sure we don't have consensus against it.",
        "type": "Discuss"
      },
      {
        "ad": "Eric Rescorla",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2018-02-28 06:53:21-08:00",
        "text": "I appreciate all the work that the authors have put into this document, and I think it makes a number of good points. However, at the end of the day, I don't think publishing an IETF RFC devoted to listing all the problems that encryption creates -- even with a bunch of disclaimers -- is consistent with the direction the IETF is otherwise taking towards universal encryption.",
        "type": "Abstain"
      }
    ],
    "Jari Arkko": [
      {
        "ad": "Jari Arkko",
        "end": "2017-03-15 17:55:54-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Jari Arkko",
        "end": "2017-03-31 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2017-03-15 17:55:54-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Joel Jaeggli": [
      {
        "ad": "Joel Jaeggli",
        "end": "2017-03-16 02:54:39-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Joel Jaeggli",
        "end": "2017-03-31 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2017-03-16 02:54:39-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Kathleen Moriarty": [
      {
        "ad": "Kathleen Moriarty",
        "end": "2017-03-13 07:38:28-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Kathleen Moriarty",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-03-13 07:38:28-07:00",
        "text": null,
        "type": "Recuse"
      }
    ],
    "Mirja Kuhlewind": [
      {
        "ad": "Mirja Kuhlewind",
        "end": "2017-03-14 04:21:22-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Mirja Kuhlewind",
        "end": "2018-02-02 06:30:46-08:00",
        "end_reason": "position_updated",
        "start": "2017-03-14 04:21:22-07:00",
        "text": "Why is section 11 in the appendix only? I would see this as an important part of the document because it seems to me that mobile operators are the ones most impacted by encryption.",
        "type": "Discuss"
      },
      {
        "ad": "Mirja Kuhlewind",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2018-02-02 06:30:46-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Spencer Dawkins": [
      {
        "ad": "Spencer Dawkins",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Stephen Farrell": [
      {
        "ad": "Stephen Farrell",
        "end": "2017-03-08 07:24:10-08:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Stephen Farrell",
        "end": "2017-03-31 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Suresh Krishnan": [
      {
        "ad": "Suresh Krishnan",
        "end": "2017-03-16 06:49:12-07:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Suresh Krishnan",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-03-16 06:49:12-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Terry Manderson": [
      {
        "ad": "Terry Manderson",
        "end": "2018-02-07 16:15:54-08:00",
        "end_reason": "new_position",
        "start": "2017-03-08 07:24:10-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Terry Manderson",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2018-02-07 16:15:54-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Warren Kumari": [
      {
        "ad": "Warren Kumari",
        "end": "2017-04-06 13:07:37-07:00",
        "end_reason": "new_position",
        "start": "2017-03-26 00:00:00+00:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Warren Kumari",
        "end": "2017-04-12 13:18:37-07:00",
        "end_reason": "position_updated",
        "start": "2017-04-06 13:07:37-07:00",
        "text": null,
        "type": "No Objection"
      },
      {
        "ad": "Warren Kumari",
        "end": "2018-03-19 02:41:43-07:00",
        "end_reason": "evaluation_closed",
        "start": "2017-04-12 13:18:37-07:00",
        "text": null,
        "type": "Yes"
      }
    ]
  },
  "doc_name": "rfc8404",
  "evaluation_end": "2018-03-19 02:41:43-07:00",
  "evaluation_start": "2017-03-08 07:24:10-08:00"
}