{
  "all_ballots": {
    "Adam Roach": [
      {
        "ad": "Adam Roach",
        "end": "2019-12-04 21:44:25-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Adam Roach",
        "end": "2020-03-27 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2019-12-04 21:44:25-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alexey Melnikov": [
      {
        "ad": "Alexey Melnikov",
        "end": "2020-03-27 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Alissa Cooper": [
      {
        "ad": "Alissa Cooper",
        "end": "2019-12-03 11:52:34-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2020-03-18 12:18:25-07:00",
        "end_reason": "position_updated",
        "start": "2019-12-03 11:52:34-08:00",
        "text": "Exciting to see this work progressing. Section 3.5 (and Section 7): \"Type (8 bits):  Type indicating the format of the data contained in       this option.  Options are primarily designed to encourage future       extensibility and innovation and so standardized forms of these       options will be defined in a separate document.\"      I'm a little confused about what is expected to happen with the option classes and types. Are all future option types in the 0x0000..0x00FF range expected to be specified in a single separate document? If not, that should be clarified. I also think there needs to be a normative requirement that such future specifications define all of the types associated with the option classes. In the registry defined in Section 7, I think the table needs a column for the document to reference for each option class definition. That way when option classes are defined in the 0x0000..0x00FF range, implementers and operators will be able to find the reference and understand the semantics of the types. For the vendor-specific options this can be optional, but still would be nice to list if such documentation exists.",
        "type": "Discuss"
      },
      {
        "ad": "Alissa Cooper",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-18 12:18:25-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Alvaro Retana": [
      {
        "ad": "Alvaro Retana",
        "end": "2019-12-03 08:44:56-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2019-12-03 08:44:56-08:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Barry Leiba": [
      {
        "ad": "Barry Leiba",
        "end": "2019-12-04 19:24:19-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Barry Leiba",
        "end": "2020-03-01 08:38:20-08:00",
        "end_reason": "position_updated",
        "start": "2019-12-04 19:24:19-08:00",
        "text": "This will be trivial to address: — Section 1.2 —    The NVO3 framework [ RFC7365 ] defines many of the concepts commonly    used in network virtualization. Indeed, and it seems a critical normative reference here.  So why is it in the informative section?",
        "type": "Discuss"
      },
      {
        "ad": "Barry Leiba",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-01 08:38:20-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Benjamin Kaduk": [
      {
        "ad": "Benjamin Kaduk",
        "end": "2019-12-04 16:36:32-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Benjamin Kaduk",
        "end": "2020-04-27 17:30:05-07:00",
        "end_reason": "position_updated",
        "start": "2019-12-04 16:36:32-08:00",
        "text": "This first point is a \"discuss discuss\" for which I'd like to get a sense of what the rest of the IESG feels.  I've read the discussion at https://mailarchive.ietf.org/arch/msg/last-call/ywRKREnxWAlunHR7MSaTM4ScsDs but I'm left with a similar sense of uncertainty that Daniel has as to whether the question is fully resolved.  Specifically, \"the question\" that I have in mind is to what extent the Geneve architecture includes support for middleboxes that inspect (but do not modify!) the Geneve header and inner payload, to what extent the Geneve architecture is intended to be applicable to scenarios where (end-to-end per-tunnel) underlay confidentiality protection is necessary, and whether those requirements are both strong enough to be deemed an internal inconsistency of requirements/applicability.  \"Interposing advanced middleboxes\" and \"service interposition\" are conceived as possible uses for Geneve metadata in Sections 1 and 2.2 as a consideration for why structured tagging is needed on the data plane and not just the control plane, which to me suggests that such usage is considered a first-class use case for Geneve.  Section 6.1.1 discusses encryption for traffic traversing untrusted links between geographically separated data centers (though perhaps in this case an encrypted tunnel would be used just for that untrusted transit and leaving the in-datacenter traffic visible to middleboxes), but Section 6.1 discusses cases where the tenant may expect the service provider to provide confidentiality as part of the service.  Would this be above or below the Geneve encapsulation? Might some customers insist on one or the other?  The consideration from Section 6.1 that the provider of the underlay and the provider of the overlay may not be the same could be taken to imply that the overlay provider itself wants (cryptographic) protection from the underlay provider.  I don't have a clear picture of how these considerations interact.  (I also note that, since DTLS is mentioned, DTLS 1.3 is going the way of TLS 1.3 and not defining any authentication-only ciphersuites, so if authentication-only service is desired, DTLS may not be the way of the future, leaving IPsec AH as the leading candidate.) Some other section-by-section discuss-level points follow, mostly self-contained/localized issues. Section 3.5.1    o  Some options may be defined in such a way that the position in the       option list is significant.  Options MUST NOT be changed by       transit devices.    o  An option SHOULD NOT be dependent upon any other option in the       packet, i.e., options can be processed independently of one       another.  [...] As was already noted, I don't see how these two requirements are self-consistent.    size.  A particular option is specified to have either a fixed    length, which is constant, or a variable length, which may change    over time or for different use cases.  This property is part of the    definition of the option and conveyed by the 'Type'.  For fixed This text is written as if this specification is going to specify further substructure for the \"Type\", with respect to certain types that have fixed length and others that may vary.  Otherwise the property would be attached to the option value and not the type value, in my understanding.  With the current way the registry is laid out it seems like we need to explicitly say that the entity allocating the option class value needs to specify the interpretation of the 'type' field when used with that option class. Section 4.3.1    2.  If Geneve is used with zero UDP checksum over IPv6 then such        tunnel endpoint implementation MUST meet all the requirements        specified in section 4 of [ RFC6936 ] and requirements 1 as        specified in section 5 of [ RFC6936 ]. This seems to implicitly be saying that the other numbered requirements in Section 5 of  RFC 6936  can be ignored, which is updating the behavior of a standards-track document.  We need to either be explicit about the update or justify why (the rest of) that applicability statement is not applicable here.  If, as the paragraph following the enumerated list says, the requirements specified in  RFC 6936  continue to apply in full, why do we need to call out a MUST-level requirement here?    4.  The Geneve tunnel endpoint that encapsulates the tunnel MAY use        different IPv6 source addresses for each Geneve tunnel that uses        Zero UDP checksum mode in order to strengthen the decapsulator's        check of the IPv6 source address (i.e the same IPv6 source        address is not to be used with more than one IPv6 destination        address, irrespective of whether that destination address is a        unicast or multicast address).  When this is not possible, it is        RECOMMENDED to use each source address for as few Geneve tunnels        that use zero UDP checksum as is feasible. This functionality is not usable without some mechanism to signal from encapsulator to decapsulator that it is in use.    The requirement to check the source IPv6 address in addition to the    destination IPv6 address, [...] I do not see this specified as a requirement, only a MAY-level suggestion. Section 4.6    o  When performing LSO, a NIC MUST replicate the entire Geneve header       and all options, including those unknown to the device, onto each       resulting segment.  However, a given option definition may       override this rule and specify different behavior in supporting       devices.  [...] This second sentence makes the MUST in the first no longer a MUST.",
        "type": "Discuss"
      },
      {
        "ad": "Benjamin Kaduk",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-04-27 17:30:05-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Deborah Brungard": [
      {
        "ad": "Deborah Brungard",
        "end": "2019-12-04 09:25:21-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Deborah Brungard",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2019-12-04 09:25:21-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Eric Vyncke": [
      {
        "ad": "Eric Vyncke",
        "end": "2019-12-04 10:03:52-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Eric Vyncke",
        "end": "2020-02-29 23:27:04-08:00",
        "end_reason": "position_updated",
        "start": "2019-12-04 10:03:52-08:00",
        "text": "Thank you for the work put into this document. It solves an interesting problem and the document is easy to read. I have one DISCUSS that is **trivial to fix** and some COMMENTs, feel free to ignore my COMMENTs even if  I would appreciate your answers to those COMMENTs. Regards, -éric == DISCUSS == -- Section 3.3 -- Please use  RFC 8200  the 'new' IPv6 standard rather than  RFC 2460  ;-)",
        "type": "Discuss"
      },
      {
        "ad": "Eric Vyncke",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-02-29 23:27:04-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Ignas Bagdonas": [
      {
        "ad": "Ignas Bagdonas",
        "end": "2020-03-27 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Magnus Westerlund": [
      {
        "ad": "Magnus Westerlund",
        "end": "2019-12-05 06:16:23-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Magnus Westerlund",
        "end": "2020-03-02 06:52:36-08:00",
        "end_reason": "position_updated",
        "start": "2019-12-05 06:16:23-08:00",
        "text": "I want to discuss the implications of the source port usage and if that needs a bit more consideration of failure cases and ICMP. So Section 3.3 says:    Source port:  A source port selected by the originating tunnel       endpoint.  This source port SHOULD be the same for all packets       belonging to a single encapsulated flow to prevent reordering due       to the use of different paths.  To encourage an even distribution       of flows across multiple links, the source port SHOULD be       calculated using a hash of the encapsulated packet headers using,       for example, a traditional 5-tuple.  Since the port represents a       flow identifier rather than a true UDP connection, the entire       16-bit range MAY be used to maximize entropy. I think using the different source ports to enable flow hashing is a nice idea. However, I am a bit worried over the implications of using the full 16-bit range without caveats. Specifically in cases where a network error or other failure to forward the Geneve encapsulated packet and that result in any form a return traffic towards the tunnel ingress. Such as ICMP Packet Too Big messages or Port / Host unreachable. These messages needs to be consumed by the Geneve tunneling endpoint to affect the right response to them. However, if the source port is corresponding to any port where there exist a listenser or bi-directional server on the tunnel ingress host, such as SSH, Echo etc. the ICMP messages may be consumed by the wrong entity that only filter on source port and not the destination port.  I believe this issue may require at least a explicit consideration in the document. Otherwise thanks for thinking through many transport issues for tunnels.",
        "type": "Discuss"
      },
      {
        "ad": "Magnus Westerlund",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-02 06:52:36-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Martin Vigoureux": [
      {
        "ad": "Martin Vigoureux",
        "end": "2019-11-26 03:30:17-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Martin Vigoureux",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Mirja Kuhlewind": [
      {
        "ad": "Mirja Kuhlewind",
        "end": "2019-12-03 11:05:02-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Mirja Kuhlewind",
        "end": "2019-12-04 10:13:34-08:00",
        "end_reason": "discuss_updated",
        "start": "2019-12-03 11:05:02-08:00",
        "text": "nline with RFC6335 the Assignee and Contact of the port entry should also be updated to IESG  and IETF Chair  respectively.",
        "type": "Discuss"
      },
      {
        "ad": "Mirja Kuhlewind",
        "end": "2020-03-04 01:29:20-08:00",
        "end_reason": "position_updated",
        "start": "2019-12-04 10:13:34-08:00",
        "text": "Thanks for the really well written document that addresses all transport related question well (and thanks to David for the early TSV review!). I only have one minor process point that need to be addressed before publication: Inline with  RFC6335  the Assignee and Contact of the port entry should also be updated to IESG  and IETF Chair  respectively.",
        "type": "Discuss"
      },
      {
        "ad": "Mirja Kuhlewind",
        "end": "2020-03-27 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2020-03-04 01:29:20-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Roman Danyliw": [
      {
        "ad": "Roman Danyliw",
        "end": "2019-12-04 18:03:42-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Roman Danyliw",
        "end": "2020-03-03 06:36:46-08:00",
        "end_reason": "position_updated",
        "start": "2019-12-04 18:03:42-08:00",
        "text": "(1) The threat model assumed by geneve appears to be expressed in conflicting ways.  Section 4.1 notes that  RFC8085 ’s definition of “controlled environment” applies.  However,  - Section 6 notes “When crossing an untrusted link, such as the public Internet, …” - Section 6.1 notes “Geneve data traffic between tenant systems across such separated networks should be protected from threats when traversing public networks. Any Geneve overlay data leaving the data center network beyond the operator's security domain SHOULD be secured by encryption mechanisms such as IPsec or other VPN mechanisms to protect the communications between the NVEs when they are geographically separated over untrusted network links.”   The advice provided in Section 6.x is sound.  Nevertheless, it doesn’t appear to describe a “controlled environment”. (2) Section 6.  Per “Compromised tunnel endpoints may also spoof identifiers in the tunnel header to gain access to networks owned by other tenants”, couldn’t compromised transit devices do the same? (3) Section 6.1.  Similar to what is discussed in Section 6.2 (for integrity), please refer to the impact of a compromised node on confidentiality.  For example (not verbatim) “A compromised network node or a transit device within a data center may passively monitor Geneve packet data between NVEs; or route traffic for further inspection.” (4) Section 6.1.  Per “Due to the nature of multi-tenancy in such environments, a tenant system may expect data confidentiality to ensure its packet data is not tampered with (active attack) in transit or a target of unauthorized monitoring (passive attack).”, please provide additional precision on the confidentiality. It is only relative to other tenants, but not from the provider (who can engage in tampering and passive monitoring).",
        "type": "Discuss"
      },
      {
        "ad": "Roman Danyliw",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2020-03-03 06:36:46-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Suresh Krishnan": [
      {
        "ad": "Suresh Krishnan",
        "end": "2019-12-05 05:37:39-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Suresh Krishnan",
        "end": "2020-03-01 10:28:27-08:00",
        "end_reason": "position_updated",
        "start": "2019-12-05 05:37:39-08:00",
        "text": "* Section 3.3. This might be an easy DISCUSS to resolve. Since the specification requires the Destination port to be configurable, it is not clear to me how the \"transit\" devices will identify Geneve packets being sent to a non-default port (i.e. not 6081). Can you please clarify?",
        "type": "Discuss"
      },
      {
        "ad": "Suresh Krishnan",
        "end": "2020-03-27 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2020-03-01 10:28:27-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Warren Kumari": [
      {
        "ad": "Warren Kumari",
        "end": "2019-12-04 10:28:20-08:00",
        "end_reason": "new_position",
        "start": "2019-11-26 03:30:17-08:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Warren Kumari",
        "end": "2020-04-28 07:52:45-07:00",
        "end_reason": "evaluation_closed",
        "start": "2019-12-04 10:28:20-08:00",
        "text": null,
        "type": "No Objection"
      }
    ]
  },
  "doc_name": "rfc8926",
  "evaluation_end": "2020-04-28 07:52:45-07:00",
  "evaluation_start": "2019-11-26 03:30:17-08:00"
}