{
  "all_ballots": {
    "Alvaro Retana": [
      {
        "ad": "Alvaro Retana",
        "end": "2022-04-06 05:59:30-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-04-06 05:59:30-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Andrew Alston": [
      {
        "ad": "Andrew Alston",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Benjamin Kaduk": [
      {
        "ad": "Benjamin Kaduk",
        "end": "2022-03-25 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Eric Vyncke": [
      {
        "ad": "Eric Vyncke",
        "end": "2022-04-04 01:06:49-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Eric Vyncke",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-04-04 01:06:49-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Erik Kline": [
      {
        "ad": "Erik Kline",
        "end": "2022-03-23 00:04:24-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Erik Kline",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Francesca Palombini": [
      {
        "ad": "Francesca Palombini",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "John Scudder": [
      {
        "ad": "John Scudder",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Lars Eggert": [
      {
        "ad": "Lars Eggert",
        "end": "2022-04-05 07:25:00-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Lars Eggert",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-04-05 07:25:00-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Martin Duke": [
      {
        "ad": "Martin Duke",
        "end": "2022-04-04 10:42:15-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Martin Duke",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-04-04 10:42:15-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Martin Vigoureux": [
      {
        "ad": "Martin Vigoureux",
        "end": "2022-03-25 00:00:00+00:00",
        "end_reason": "ad_term_ended",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Murray Kucherawy": [
      {
        "ad": "Murray Kucherawy",
        "end": "2022-04-06 22:32:56-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Murray Kucherawy",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-04-06 22:32:56-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Paul Wouters": [
      {
        "ad": "Paul Wouters",
        "end": "2022-04-05 15:07:49-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Paul Wouters",
        "end": "2022-08-19 09:25:57-07:00",
        "end_reason": "position_updated",
        "start": "2022-04-05 15:07:49-07:00",
        "text": "I must apologize first to the authors. Many months ago I promised to send a diff with language improvements, and I did not do so. Unfortunately, I do think the document needs this and the amount is too much to leave on the RFC Editor. I will send a separate diff for language improvements to the authors and not further comment on language in my ballot here. [1] Section 2: It suggests a partial SPI match can be used, based on the assumption that the SPI number is known to have mostly zeros because the device only uses a hardcoded limited set (eg 257 to 260). While this is true for the outbound SPI, this may not be true for the inbound SPI, especially if the peer is not a \"minimal ESP\" device but a regular multipurpose OS. I think some clarification is needed for this minimum implementation optimization. [2] Section 2.1:        SPI that are not randomly generated over 32 bits may lead to privacy        and security concerns. The \"may lead to security concerns\" would be something that at the very least needs to be understood and specified in the Security Considerations section. If it is too difficult to determine the concerns, perhaps this optimization should be removed from the draft.        As a result, the use of alternative designs requires careful security        and privacy reviews. If it is known this proposal requires careful security reviews, were these done? If so, why not replace this warning of danger with the actual output of those reviews? If reviews were not done, it would imply this document hasn't fully worked out its Security Considerations. [3]        SPI can typically be used to implement a key update What is a \"key update\" in this context? It seems this section is suggesting to use part of the SPI octet space to signal things to another part of the code on the device? If so, would that code part then clear out those overloaded SPI octets or would they go (unencrypted!) over the network for everyone to see? [4]        While the use of randomly generated SPIs may reduce the leakage or        privacy of security related information by ESP itself, these        information may also be leaked otherwise. This is not a strong argument. This sentence and the entire paragraph really seem to want to say something like \"if you can see the network packets, the information leak would already be present by seeing the encrypted traffic, irrespective of whether the SPI is truly random or selected in a way that identifies the manufacturer\" [5]        The security of all data        protected under a given key decreases slightly with each message I do not know of a generic claim like this for ESP. Can a reference be provided? In general, rekeying is done to avoid decrypting previous traffic in case of a key compromise. Or perhaps you mean the limits of algorithms like AES_CBC (or 3DES) with respect to birthday and collision attacks? eg the commonly used maximum of 2^32-1 crypto operations (which is not the same as maximum packets) In these cases, the SN is only relevant for very high speed links, eg gbps and would never apply to an IoT device that requires minimal ESP. [6] As noted in the TSVART review:        Also, for devices that spend significant time sleeping, the SN        would jump hugely on first waking. That shouldn't require any        larger window (unless a stale packet from prior to the sleep was        only released after a new packet on waking). But the receiver        would need to be able to somehow detect massive jumps in the high        order bits that are not communicated in the SN field. Perhaps the document can add more specific detail on how to use the commonly implemented time values into valid SNs that avoid ESN issues ? [7]        so the constrained device may not proceed to such checks The language issue here inverts the meaning. What is meant is \"so the constrained device may omit such checks\" [8]        TFC has not yet being widely adopted for standard ESP traffic. It is widely implemented (eg in Linux). I agree that using it seems rare. I am not convinced the reason for this is as is written. The issue I think more relates to deciding to what size to pad. The easiest is to use the MTU, but due to various encapsulation techniques (ESPinUDP, PPP-OE) it is not always clear what the MTU of the IPsec link is. And path MTU discovery with IPsec does not really work in practice. But if the application/device tends to send packets between 1 and say 125 bytes, it could always pad to 125 to not leak any information by packet size. The question on when to do this or not really depends on the traffic being protected. And if this the case, then it might be best to let the IKEv2 negotiation determine whether or not to use this - just like regular use of TFC. Regardless, TFC is optional and a minimum implementation can just omit it. Since this document would also be combined with efforts reducing sending bytes to preserve energy, it would make sense to avoid using TFC padding. Especially for sensors that for example just always send a one byte temperature value to begin with.        Such information could be used by the attacker in case a vulnerability is        disclosed on the specific device. I don't think \"vulnerability\" here is the issue. It could lead to exposing the size of the original packet being protected by IPsec, which could (or could not) leak information to an observer on the network. [9]        a minimal ESP implementation may not generate such dummy packet. I think what is meant is \"MUST NOT generate\". [10] The Next Header Section is better named Dummy Packet. While it discusses the mandatory Next Header field, it really only states not to send Dummy Packets. But it almost reads as if the Next Header can be ignored or omitted. [11]        4.  Avoid Padding by sending payload data which are aligned to            the cipher block length - 2 for the ESP trailer. Isn't this advise just moving the padding from the IPsec layer to the application layer? Eg the packet size or energy use would not be different if one implements this advise? [12] Would it be useful to be able to signal a \"mininum ESP\" via IKEv2? I can imagine a simple Notify could be used to signal this. A peer receiving this could then ensure it is behaving in a \"minimum ESP\" compatible way even if it is a multi-purpose OS.",
        "type": "Discuss"
      },
      {
        "ad": "Paul Wouters",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-08-19 09:25:57-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Robert Wilton": [
      {
        "ad": "Robert Wilton",
        "end": "2022-04-07 03:32:02-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Robert Wilton",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-04-07 03:32:02-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Roman Danyliw": [
      {
        "ad": "Roman Danyliw",
        "end": "2022-04-06 19:42:05-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Roman Danyliw",
        "end": "2022-09-12 10:39:40-07:00",
        "end_reason": "position_updated",
        "start": "2022-04-06 19:42:05-07:00",
        "text": "** Section 5.  The paragraph starting with “As the generation of dummy packets …” would benefit from refinement.  It starts with saying dummy packets “may be avoided”, but the second half of the paragraph argues the opposite.  The use cases of constrained devices concerned about device lifetimes (first half of the paragraph) doesn’t seem mutually exclusive from those with dedicated applications (second half).  I recommend being cleared on the assumptions guiding the use of dummy packets.",
        "type": "Discuss"
      },
      {
        "ad": "Roman Danyliw",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-09-12 10:39:40-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Warren Kumari": [
      {
        "ad": "Warren Kumari",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Zaheduzzaman Sarker": [
      {
        "ad": "Zaheduzzaman Sarker",
        "end": "2022-04-06 05:18:20-07:00",
        "end_reason": "new_position",
        "start": "2022-03-23 00:04:24-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Zaheduzzaman Sarker",
        "end": "2022-09-27 09:05:40-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-04-06 05:18:20-07:00",
        "text": null,
        "type": "No Objection"
      }
    ]
  },
  "doc_name": "rfc9333",
  "evaluation_end": "2022-09-27 09:05:40-07:00",
  "evaluation_start": "2022-03-23 00:04:24-07:00"
}