{
  "all_ballots": {
    "Alvaro Retana": [
      {
        "ad": "Alvaro Retana",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Andrew Alston": [
      {
        "ad": "Andrew Alston",
        "end": "2022-11-30 02:54:02-08:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Andrew Alston",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-11-30 02:54:02-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Eric Vyncke": [
      {
        "ad": "Eric Vyncke",
        "end": "2022-11-29 01:36:44-08:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Eric Vyncke",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-11-29 01:36:44-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Erik Kline": [
      {
        "ad": "Erik Kline",
        "end": "2022-11-29 19:16:24-08:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Erik Kline",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-11-29 19:16:24-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Francesca Palombini": [
      {
        "ad": "Francesca Palombini",
        "end": "2022-12-01 03:22:13-08:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Francesca Palombini",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-12-01 03:22:13-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "John Scudder": [
      {
        "ad": "John Scudder",
        "end": "2022-11-30 12:56:34-08:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "John Scudder",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-11-30 12:56:34-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Lars Eggert": [
      {
        "ad": "Lars Eggert",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Martin Duke": [
      {
        "ad": "Martin Duke",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Murray Kucherawy": [
      {
        "ad": "Murray Kucherawy",
        "end": "2022-11-30 23:31:59-08:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Murray Kucherawy",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-11-30 23:31:59-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Paul Wouters": [
      {
        "ad": "Paul Wouters",
        "end": "2022-11-28 13:08:51-08:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Paul Wouters",
        "end": "2022-12-01 05:36:52-08:00",
        "end_reason": "position_updated",
        "start": "2022-11-28 13:08:51-08:00",
        "text": "# Sec AD review of  draft-ietf-ipsecme-ikev2-multiple-ke-10 CC @paulwouters Please refer to  https://www.ietf.org/about/groups/iesg/statements/handling-ballot-positions/ for more information about how to handle DISCUSS and COMMENT positions. This review uses the format specified in  https://github.com/mnot/ietf-comments/  which allows automated tools to process items (eg to produce github issers) Let me first apologize to Valery for not getting to review this document earlier. He surely reminded me enough times to do it before it landed at the IESG. This is a very well written document. Thanks to everyone involved. While I have a few DISCUSS comments, these should be easy to address or convince me why no changes are required. Note to self (and Valery):  draft-kampati-ipsecme-ikev2-sa-ts-payloads-opt  needs to be updated to support this document. It currently only supports sending one KE payload. ## DISCUSS ### IANA entries mentions in the Introduction ? Shouldn't the introduction mention this draft introduces the IKE_FOLLOWUP_KE Exchange and the STATE_NOT_FOUND Notify Message Type, along with additional entries to the (now renamed) Key Exchanges Methods registry? ### Additional key exchanges DoS ? The following paragraph raised an issue for me: ```    If the responder selects NONE for some Additional Key Exchange types    (provided they are proposed by the initiator), then the corresponding    IKE_INTERMEDIATE exchanges MUST NOT take place. ```     If the initiator's local policy requires at least one Additional Key Exchange, an attacker sending back a quick reply with only NONE replies would be a DoS. I think similar to like the original IKE_SA_INIT, perhaps we need to give some advise that if the local policy would lead to permanent failure, that it should wait for other (more legitimate) responses to this IKE_SA_INIT ? ### ADDITIONAL_KEY_EXCHANGE ```    After IKE SA is created the window size may be greater than one and    multiple concurrent exchanges may be in progress, it is essential to    link the IKE_FOLLOWUP_KE exchanges together ``` I had some trouble figuring out why these are needed. For Child SA rekeys, these would not be needed, because we would have an old SPI and MSGID that would make the order obvious. But for adding addtional Child SA's, we have no old SPI. But we have a new SPI on the initiator (and then a new SPI on the responder in the answer. Since these are coupled by MSGID, I wonder if ADDITIONAL_KEY_EXCHANGE is really needed? Looking at the useful appendix examples, I realise that the IKE_FOLLOWUP_KE exchange does not have an SA payload so no SPI, so it makes sense to me now. Perhaps a sentence in the document would be useful to explain this? I still do not know why not to use the SPI as value for ADDITIONAL_KEY_EXCHANGE instead of an opaque linking blob? The SPI is traditionally our linking blob. Could the IKE_FOLLOWUP_KE set the SPI value in the IKE header instead of using a new ADDITIONAL_KEY_EXCHANGE payload and use that with the MSGID as linking blob? ### State loss issue ```         After receiving this notification the initiator MAY start    a new CREATE_CHILD_SA exchange which may eventually be followed by    the IKE_FOLLOWUP_KE exchanges, to retry the failed attempt.  If the    initiator continues to receive STATE_NOT_FOUND notifications [...] ``` How could this happen? If the state was lost, eg due to reboot, there would need to come a new IKE SA, that can then send a new CREATE_CHILD_SA. I don't see how that could lead to another STATE_NOT_FOUND. But the paragraph then also continues with \"and delete [the] IKE SA\". But this IKE SA is brand new?  I would just remove this entire paragraph as I think this cannot happen. Or at least it is not a special case and existing abort code handles this already. ### IKE session resumption Should there be a section updating  RFC 5723  Section 5.1, or is the method there specified quantum-safe if the initial IKE SA was protected using this document's mechanism? See  https://www.rfc-editor.org/rfc/rfc5723.html#section-5.1 I think the IKE resumption can work \"as normal\", as no KE payload is involved in the resumption, but it would be nice if a sentence somewhere in this document could confirm this.  Also  RFC 5723  states: ``` The keys and cryptographic protection algorithms should be at       least 128 bits in strength. ``` IF we live in Grover universe, perhaps that should be 256 bits in strength? And since we are making things quantum safe with this document, perhaps we should then at least state session tickets should be 256 bits. Note if we do, then this document must Update:  RFC 5723 . Perhaps this note on 5723 can be added in the Security Considerations Section paragraph that talks about Grover and Shor. ### non-fatal NO_PROPOSAL_CHOSEN? ```    In this case, the responder may respond with    non-fatal error such as NO_PROPOSAL_CHOSEN notify message type. ```      Technically, this error is non-fatal. But in this context, wouldn't it be fatal if the responder insists on additional exchanges during the initial exchange and the initiator doesn't suppor this? It is sort of a lame duck IKE SA ? :) Also the \"may\" responder is unclear to me. What other response could there be and why? ### misplaced text? ```    Note that if the initial IKE SA is used to transfer sensitive    information, then this information will not be protected using the    additional key exchanges [...] ``` This paragraph appears in the Section \"Interaction with Childless IKE SA\", but should probably be moved to the Security Considerations section. ### IKE_FOLLOWUP_KE name I find the name IKE_FOLLOWUP_KE a little confusing, as this exchange applies to IKE and IPsec SA rekey negotiations. Why is it not called FOLLOWUP_ADDITIONAL_KE ? Or CREATE_CHILD_SA_FOLLOWUP(_KE) (a sort of bad name too but that at least follows the bad name from the original IKEv2 spec) ### authentication ? ```          This document does not address authentication since it is less urgent         at this stage. ``` While true, it does state that PPKs can be used. It might also want to say that no IKE protocol level changes would be needed for authentication. A new  RFC 7427 Digital Signature algorithm that is quantum-safe could be defined for X.509 and would become available immediately without any IKEv2 level changes. So in a way, this issue will be addressed but no IKEv2 document is needed for that. Perhaps this can be clarified in the draft? Related to this is text in the Security Considerations: ```    In particular, the authenticity of the SAs established    under IKEv2 is protected using a pre-shared key, RSA, DSA, or ECDSA    algorithms. ```  This text is also incorrect as  RFC 7427  allows us to use post-quantum authentication algorithms that have a SubjectPublicKeyInfo (SPKI) definition. There might not be any now, but there will presumbly be some in the future. ### AH Section 4 lists AH. Is there much point in using this document when deploying AH? The idea was the protect against _future_ quantum computers breaking encryption, not MITM style packet modification. So using AH (or ESP_NULL) with this document seems pointless :) And the Security Considerations kind of agree with me here: ```    Until quantum computers    become available there is no point in attacking the authenticity of a    connection because there are no possibilities for exploitation. ```",
        "type": "Discuss"
      },
      {
        "ad": "Paul Wouters",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-12-01 05:36:52-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Robert Wilton": [
      {
        "ad": "Robert Wilton",
        "end": "2022-11-29 08:46:31-08:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Robert Wilton",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-11-29 08:46:31-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Roman Danyliw": [
      {
        "ad": "Roman Danyliw",
        "end": "2022-10-24 04:36:12-07:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Roman Danyliw",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Warren Kumari": [
      {
        "ad": "Warren Kumari",
        "end": "2022-11-29 14:18:33-08:00",
        "end_reason": "new_position",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Warren Kumari",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-11-29 14:18:33-08:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Zaheduzzaman Sarker": [
      {
        "ad": "Zaheduzzaman Sarker",
        "end": "2022-12-09 07:19:45-08:00",
        "end_reason": "evaluation_closed",
        "start": "2022-10-24 04:36:12-07:00",
        "text": null,
        "type": "No Record"
      }
    ]
  },
  "doc_name": "rfc9370",
  "evaluation_end": "2022-12-09 07:19:45-08:00",
  "evaluation_start": "2022-10-24 04:36:12-07:00"
}