{
  "all_ballots": {
    "Alvaro Retana": [
      {
        "ad": "Alvaro Retana",
        "end": "2022-07-11 13:50:42-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2022-08-02 13:15:41-07:00",
        "end_reason": "position_updated",
        "start": "2022-07-11 13:50:42-07:00",
        "text": "§7 (\"Results of the Alternate Marking Experiment\") makes several  recommendations about the use of one or two flag bits:       One flag: packet loss measurement SHOULD be done as described in       Section 3.1, while delay measurement MAY be done according to the       single-marking method described in Section 3.2.1.  Mean delay       (Section 3.2.1.1) is NOT RECOMMENDED since it implies more       computational load.       Two flags: packet loss measurement SHOULD be done as described in       Section 3.1, while delay measurement SHOULD be done according to       double-marking method Section 3.2.2.  In this case single-marking       MAY also be used in combination with double-marking and the two       approaches provide slightly different pieces of information that       can be combined to have a more robust data set. These recommendations are good, as they are the result of experimentation.   However, they don't provide any deployment or operational guidelines of when  is it ok to follow them and when it isn't.  For example, for the one flag case,  when it is ok to not measure packet loss as described in §3.1?  Why is the use  of that mechanism only recommended and not required? I have the same questions for all the recommendations and optional indications  in the text above.  To clear this DISCUSS I expect deployment or operational  recommendations that can be used as implementation/deployment guidance.",
        "type": "Discuss"
      },
      {
        "ad": "Alvaro Retana",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-08-02 13:15:41-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Andrew Alston": [
      {
        "ad": "Andrew Alston",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Eric Vyncke": [
      {
        "ad": "Eric Vyncke",
        "end": "2022-07-12 05:22:19-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Eric Vyncke",
        "end": "2022-08-25 23:00:24-07:00",
        "end_reason": "position_updated",
        "start": "2022-07-12 05:22:19-07:00",
        "text": "# Éric Vyncke, INT AD, comments for  draft-ietf-ippm-rfc8321bis-02 CC @evyncke Thank you for the work put into this document.  Please find below one blocking DISCUSS points (easy to address), some non-blocking COMMENT points (but replies would be appreciated even if only for my own education), and some nits. Please note that Tim Winters is the Internet directorate reviewer (at my request) and you may want to consider this int-dir review as well when Tim will complete the review (no need to wait for it though): https://datatracker.ietf.org/doc/draft-ietf-ippm-rfc8321bis/reviewrequest/16061/ Special thanks to Tommy Pauly for the shepherd's detailed write-up including the WG consensus and the justification of the intended status.  I hope that this review helps to improve the document, Regards, -éric ## DISCUSS As noted in  https://www.ietf.org/blog/handling-iesg-ballot-positions/ , a DISCUSS ballot is a request to have a discussion on the following topics: ### Section 5 Unsure whether I understand correctly: ```    Color switching is the reference for all the network devices, and the    only requirement to be achieved is that all network devices have to    recognize the right batch along the path. ``` Why do *all network devices* have to recognize the right batch? Isn't this transparent for them?",
        "type": "Discuss"
      },
      {
        "ad": "Eric Vyncke",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-08-25 23:00:24-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Erik Kline": [
      {
        "ad": "Erik Kline",
        "end": "2022-07-13 14:03:37-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Erik Kline",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-07-13 14:03:37-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Francesca Palombini": [
      {
        "ad": "Francesca Palombini",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "John Scudder": [
      {
        "ad": "John Scudder",
        "end": "2022-07-11 13:49:03-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "John Scudder",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-07-11 13:49:03-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Lars Eggert": [
      {
        "ad": "Lars Eggert",
        "end": "2022-07-12 13:18:20-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Lars Eggert",
        "end": "2022-08-29 02:08:20-07:00",
        "end_reason": "position_updated",
        "start": "2022-07-12 13:18:20-07:00",
        "text": "# GEN AD review of  draft-ietf-ippm-rfc8321bis-02 CC @larseggert Thanks to Elwyn Davies for the General Area Review Team (Gen-ART) review ( https://mailarchive.ietf.org/arch/msg/gen-art/tX3DO8ZB3yeiaKC_xnI1khVAcss ). ## Discuss ### Section 3.1, paragraph 5 ```      The rest of the document assumes that the blocks are created      according to a fixed timer.  The switching after a fixed number of      packets is an additional possibility but its detailed specification      is out of scope. ``` This should more strongly say that the use fixed timers are REQUIRED when implementing the spec. This document should then also be stripped of all text discussing the \"fixed number of packets\" approach, to improve clarity. (You could move it to a non-normative appendix, if there is a desire to keep the text around.) ### Section 3.1, paragraph 16 ```      Two different strategies that can be used when implementing the      method: ``` If both of these strategies are part of the standard, concrete guidance needs to be given when to use one or the other. The text below about \"a limited number of traffic flows\") is too unspecific. ### Section 3.2, paragraph 1 ```      The same principle used to measure packet loss can be applied also to      one-way delay measurement.  There are three alternatives, as      described hereinafter. ``` As above, there is a lot of discussion text around these alternatives, but no concrete guidance when one SHOULD be used but not the other two. If that guidance cannot be given, I wonder if we have enough deployment experience to lift this to the Standards Track. ### Section 5, paragraph 1 ```      This document introduces two color-switching methods: one is based on      a fixed number of packets, and the other is based on a fixed timer.      But the method based on a fixed timer is preferable because it is      more deterministic, and it is considered in the document. ``` Section 3.1 says that the fixed-number-based approach is out of scope for this specification. The text above is inconsistent with that. Again, please remove the text that talks about the option that is not actually part of the intended standard (or move it to an appendix.)",
        "type": "Discuss"
      },
      {
        "ad": "Lars Eggert",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-08-29 02:08:20-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Martin Duke": [
      {
        "ad": "Martin Duke",
        "end": "2022-06-22 15:33:54-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Martin Duke",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "Yes"
      }
    ],
    "Murray Kucherawy": [
      {
        "ad": "Murray Kucherawy",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      }
    ],
    "Paul Wouters": [
      {
        "ad": "Paul Wouters",
        "end": "2022-07-14 06:18:17-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Paul Wouters",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-07-14 06:18:17-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Robert Wilton": [
      {
        "ad": "Robert Wilton",
        "end": "2022-07-14 01:09:09-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Robert Wilton",
        "end": "2022-09-08 02:19:35-07:00",
        "end_reason": "position_updated",
        "start": "2022-07-14 01:09:09-07:00",
        "text": "Sorry, another discuss, but hopefully a trivial one to resolve. I found this text to be a unclear regarding passive vs hybrid:    Therefore, the Alternate-Marking Method could be considered Hybrid or    Passive, depending on the case.  In the case where the marking method    is obtained by changing existing field values of the packets the    technique is Hybrid.  In the case where the marking field is    dedicated, reserved, and included in the protocol specification, the    Alternate-Marking technique can be considered as Passive. Please can you clarify the third sentence, to clarify that the marking is done at source, or at least outside the controlled domain?  I.e., I presume that even if there were some reserved bits in the protocol header for colouring packets, that were then written at the edge of the controlled domain, then this would be a active rather than passive measurement? Thanks, Rob",
        "type": "Discuss"
      },
      {
        "ad": "Robert Wilton",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-09-08 02:19:35-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Roman Danyliw": [
      {
        "ad": "Roman Danyliw",
        "end": "2022-07-11 10:58:52-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Roman Danyliw",
        "end": "2022-08-05 09:40:29-07:00",
        "end_reason": "position_updated",
        "start": "2022-07-11 10:58:52-07:00",
        "text": "Please clarify the expected deployment model of this approach. (a) Section 7.1    For security reasons, the Alternate Marking Method is RECOMMENDED    only for controlled domains. (b) Section 10    This document specifies a method to perform measurements in the    context of a Service Provider's network and has not been developed to    conduct Internet measurements, so it does not directly affect    Internet security nor applications that run on the Internet. The text in (a) suggests that deployment can occur on the Internet (although it isn’t recommended).  However, (b) and other documents out of IPPM (e.g.,  RFC9197 ) seem to suggest that OAM meta-data must be filtered.",
        "type": "Discuss"
      },
      {
        "ad": "Roman Danyliw",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-08-05 09:40:29-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Warren Kumari": [
      {
        "ad": "Warren Kumari",
        "end": "2022-07-12 17:41:53-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Warren Kumari",
        "end": "2022-08-26 12:28:10-07:00",
        "end_reason": "position_updated",
        "start": "2022-07-12 17:41:53-07:00",
        "text": "Section 7.1 says: \"The Alternate Marking Method is an example of a solution limited to a controlled domain [ RFC8799 ]. A controlled domain is a managed network that selects, monitors, and controls access by enforcing policies at the domain boundaries, in order to discard undesired external packets entering the domain and check internal packets leaving the domain. [...] It must be possible to control the domain boundaries, and use specific precautions if traffic traverses the Internet.\" \"Controlled domain\" isn't a magic incantation you invoke to make all security issues disappear. Your definition of controlled domain sounds suspiciously like \"the network should magically stop bad packets, and evil people wanting to do bad things!!!!\".  RFC8799  does not define what makes a domain, nor how the boundary is protected. Instead, it \"it shows the need for a precise definition of \"limited domain membership\" and for mechanisms to allow nodes to join a domain securely and to find other members, including boundary nodes.\" and notes that \"the Internet does not have a well-defined concept of limited domains\" and further that \"Domain boundaries that are defined administratively (e.g., by address filtering rules in routers) are prone to leakage caused by human error, especially if the limited domain traffic appears otherwise normal to the boundary routers.  In this case, the network operator needs to take active steps to protect the boundary.\" The document states that \"For security reasons, the Alternate Marking Method is RECOMMENDED only for controlled domains.\" - but you have not defined how a network operator is expected to define and enforce the domain boundary; simply saying that the network should select, monitor, and control access by enforcing policies at the domain boundaries, in order to discard undesired external packets doesn't explain how the network should do this. How exactly does the network know what packets are marked? How does the operator filter these? What matching rule can be applied at the boundary to make sure that marked packets do not enter or exit the network?",
        "type": "Discuss"
      },
      {
        "ad": "Warren Kumari",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-08-26 12:28:10-07:00",
        "text": null,
        "type": "No Objection"
      }
    ],
    "Zaheduzzaman Sarker": [
      {
        "ad": "Zaheduzzaman Sarker",
        "end": "2022-07-13 04:58:17-07:00",
        "end_reason": "new_position",
        "start": "2022-06-22 15:33:54-07:00",
        "text": null,
        "type": "No Record"
      },
      {
        "ad": "Zaheduzzaman Sarker",
        "end": "2022-08-29 01:57:07-07:00",
        "end_reason": "position_updated",
        "start": "2022-07-13 04:58:17-07:00",
        "text": "Thanks for working on this specification. My fellow AD colleagues have already put discusses on the concerns I have. Overall, I found this document easy to ready but lacking some clarity on the assumptions and instructions. For, this I am supporting Roman's and Lars's discuss. Apart from those I have one additional concern. ## Section 7 : says -       In the case where the marking method is applied by changing existing    fields of the packets, it is RECOMMENDED to use an additional flag or    some out-of-band signaling to indicate if the measurement is    activated or not in order to inform the measurement points.   It is not clear who is changing existing fields of which packets? It needs more specific description for at least which packets are we talking about (IP packets? ) and what additional flag we are referring to here.",
        "type": "Discuss"
      },
      {
        "ad": "Zaheduzzaman Sarker",
        "end": "2022-09-22 17:57:04-07:00",
        "end_reason": "evaluation_closed",
        "start": "2022-08-29 01:57:07-07:00",
        "text": null,
        "type": "No Objection"
      }
    ]
  },
  "doc_name": "rfc9341",
  "evaluation_end": "2022-09-22 17:57:04-07:00",
  "evaluation_start": "2022-06-22 15:33:54-07:00"
}